op {
  output: "conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 3
    ints: 7
    ints: 7
  }
}
op {
  output: "conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.189894
    floats: 0.122927256
    floats: 0.124830864
    floats: 0.270996898
    floats: 0.201984122
    floats: 0.20661214
    floats: 0.141529873
    floats: 0.23444818
    floats: 0.128350452
    floats: 0.109408073
    floats: 0.112545945
    floats: 0.271011025
    floats: 0.132409543
    floats: 0.115144409
    floats: 0.11721576
    floats: 0.139893219
    floats: 0.114630051
    floats: 0.108674258
    floats: 0.143883586
    floats: 0.150781631
    floats: 0.293916255
    floats: 0.125478253
    floats: 6.02095783e-34
    floats: 0.148898974
    floats: 0.131427303
    floats: 0.18426621
    floats: 0.335759342
    floats: 0.154924482
    floats: 0.12983112
    floats: 0.124039456
    floats: 0.14162831
    floats: 0.297412097
    floats: 0.125454962
    floats: 0.117822625
    floats: 0.114825085
    floats: 0.146266878
    floats: 0.144963965
    floats: 0.164634034
    floats: 0.0979403853
    floats: 0.115550585
    floats: 0.169181719
    floats: 0.108081132
    floats: 0.118593544
    floats: 0.0114342086
    floats: 0.10505335
    floats: 0.178951576
    floats: 0.277928144
    floats: 0.139133483
    floats: 0.337546527
    floats: 0.158716187
    floats: 0.153054744
    floats: 0.153208062
    floats: 0.178532764
    floats: 0.125229686
    floats: 0.207436353
    floats: 0.148545817
    floats: 0.115066752
    floats: 0.136861056
    floats: 0.0947393551
    floats: 0.101762697
    floats: 0.267143428
    floats: 0.145105213
    floats: 0.180719763
    floats: 0.122930996
  }
}
op {
  output: "conv1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.142269045
    floats: 0.0550927818
    floats: 0.0782256946
    floats: -0.247746706
    floats: 0.0603854656
    floats: 0.177905455
    floats: 0.0704947487
    floats: -0.0267747846
    floats: 0.070684
    floats: 0.0948249921
    floats: 0.085267365
    floats: -0.236208856
    floats: 0.0805458874
    floats: 0.0891611278
    floats: 0.073981218
    floats: 0.097081989
    floats: 0.0835121423
    floats: 0.0938066468
    floats: 0.230756074
    floats: 0.0568494312
    floats: 0.67819345
    floats: 0.101847485
    floats: -1.76086905e-33
    floats: 0.075141117
    floats: 0.0967858
    floats: 0.0592267737
    floats: 0.653131604
    floats: 0.0611483566
    floats: 0.0936145335
    floats: 0.0994053483
    floats: 0.0481548086
    floats: -0.173192888
    floats: 0.0960203
    floats: 0.0934804156
    floats: 0.100403465
    floats: 0.106374972
    floats: 0.162896216
    floats: 0.156958163
    floats: 0.0933064595
    floats: 0.0752034932
    floats: -0.116450168
    floats: 0.0425402112
    floats: 0.104497813
    floats: -0.00722839171
    floats: 0.112527587
    floats: 0.0450919606
    floats: -0.190128759
    floats: 0.0442314111
    floats: -0.355218858
    floats: 0.197819039
    floats: 0.0568724237
    floats: 0.0868981332
    floats: 0.0409791097
    floats: 0.0891228169
    floats: 0.11512804
    floats: 0.112934209
    floats: 0.0800268352
    floats: 0.107163213
    floats: 0.0899836123
    floats: 0.0860550553
    floats: -0.227279991
    floats: 0.104077257
    floats: 0.0393765718
    floats: 0.0929314569
  }
}
op {
  output: "res2a_branch2a_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 64
    ints: 3
    ints: 3
  }
}
op {
  output: "res2a_branch2a_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2a_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2a_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2a_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2a_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.129887179
    floats: 0.134317026
    floats: 0.285777062
    floats: 0.196836278
    floats: 0.298748821
    floats: 0.242983803
    floats: 0.237366334
    floats: 0.186936259
    floats: 0.0987851694
    floats: 0.0977335
    floats: 0.10318996
    floats: 0.129590333
    floats: 0.121081337
    floats: 0.137908489
    floats: 0.0816948935
    floats: 0.101412699
    floats: 0.09187565
    floats: 0.111070752
    floats: 0.144556075
    floats: 0.146348074
    floats: 0.152987197
    floats: 0.134860784
    floats: 0.112306528
    floats: 0.0860113502
    floats: 0.113082319
    floats: 0.114055313
    floats: 0.0946935937
    floats: 0.0887269899
    floats: 0.08246582
    floats: 0.13826552
    floats: 0.254050285
    floats: 0.198808834
    floats: 0.220857188
    floats: 0.080672577
    floats: 0.177650243
    floats: 0.133580029
    floats: 0.118376315
    floats: 0.18467778
    floats: 0.183831766
    floats: 0.256340444
    floats: 0.22168842
    floats: 0.185301453
    floats: 0.143116966
    floats: 0.288404644
    floats: 0.170808122
    floats: 0.0949254781
    floats: 0.173665211
    floats: 0.105005205
    floats: 0.0831598341
    floats: 0.150167957
    floats: 0.162409484
    floats: 0.207009032
    floats: 0.109983027
    floats: 0.126710132
    floats: 0.264993548
    floats: 0.161435857
    floats: 0.288552046
    floats: 0.0834038705
    floats: 0.223696426
    floats: 0.0943776071
    floats: 0.0718566626
    floats: 0.216899753
    floats: 0.113537736
    floats: 0.0994937047
  }
}
op {
  output: "res2a_branch2a_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: -0.052699361
    floats: -0.00984048937
    floats: -0.143487766
    floats: -0.120860733
    floats: -0.165322646
    floats: -0.260312796
    floats: -0.22048977
    floats: -0.0938508883
    floats: 0.0414350666
    floats: 0.0606306791
    floats: 0.0509932488
    floats: 0.287847191
    floats: 0.0329144932
    floats: 0.0132990135
    floats: 0.0511816591
    floats: 0.071180284
    floats: 0.0636358783
    floats: 0.0302035064
    floats: -0.0430140831
    floats: -0.00895107165
    floats: -0.000162544864
    floats: 0.0256482698
    floats: 0.00486896606
    floats: 0.110040389
    floats: 0.022094937
    floats: 0.00771486526
    floats: 0.077380091
    floats: 0.1247003
    floats: 0.171073914
    floats: -0.0653391555
    floats: -0.123353079
    floats: -0.211599514
    floats: -0.116745427
    floats: 0.243808046
    floats: 0.00483339047
    floats: -0.0577455275
    floats: -0.141862035
    floats: -0.0540894344
    floats: 0.00126185641
    floats: -0.13642475
    floats: -0.187095091
    floats: -0.273339033
    floats: -0.0308613
    floats: -0.14576757
    floats: 0.0279318318
    floats: 0.0480185375
    floats: -0.0416039303
    floats: 0.0488338731
    floats: 0.0639987588
    floats: 0.0218342878
    floats: -0.0243805628
    floats: -0.295253
    floats: 0.0228949487
    floats: -0.0961924195
    floats: -0.124693625
    floats: -0.0126468604
    floats: -0.185935885
    floats: 0.187930062
    floats: -0.119916968
    floats: 0.0656422079
    floats: 0.0629683509
    floats: -0.128593341
    floats: 0.291985959
    floats: 0.0530440174
  }
}
op {
  output: "res2a_branch2b_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 64
    ints: 3
    ints: 3
  }
}
op {
  output: "res2a_branch2b_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2b_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2b_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2b_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2a_branch2b_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.18399848
    floats: 0.188775524
    floats: 0.165408134
    floats: 0.172387257
    floats: 0.148038983
    floats: 0.12056727
    floats: 0.218136132
    floats: 0.200206101
    floats: 0.175021574
    floats: 0.235426351
    floats: 0.189350069
    floats: 0.219330162
    floats: 0.106336862
    floats: 0.0159377474
    floats: 0.206840277
    floats: 0.194436684
    floats: 0.18452543
    floats: 0.312261224
    floats: 0.156034574
    floats: 0.261799276
    floats: 0.200536355
    floats: 0.276754886
    floats: 0.205070421
    floats: 0.171436831
    floats: 0.19724749
    floats: 0.209383145
    floats: 0.213631287
    floats: 0.229969144
    floats: 0.235837609
    floats: 0.195453659
    floats: 0.196469
    floats: 0.196333915
    floats: 0.189932019
    floats: 0.149679318
    floats: 0.173642233
    floats: 0.160782188
    floats: 0.224349663
    floats: 0.0766795799
    floats: 0.133718595
    floats: 0.139510512
    floats: 0.200631291
    floats: 0.25990206
    floats: 0.18462877
    floats: 0.0806594491
    floats: 0.165723369
    floats: 0.147762358
    floats: 0.217740685
    floats: 0.150857687
    floats: 0.248318166
    floats: 0.182420447
    floats: 0.181473389
    floats: 0.278072625
    floats: 0.204120681
    floats: 0.232858807
    floats: 0.216303587
    floats: 0.159819692
    floats: 0.252333105
    floats: 0.152063191
    floats: 0.187210202
    floats: 0.150266171
    floats: 0.183158502
    floats: 0.165458
    floats: 0.245562553
    floats: 0.120033234
  }
}
op {
  output: "res2a_branch2b_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.0288848989
    floats: -0.02386708
    floats: 0.00953301787
    floats: -0.0254262071
    floats: 0.15250504
    floats: 0.0682424903
    floats: 0.0485588685
    floats: 0.0535345376
    floats: -0.0124025382
    floats: 0.143894926
    floats: 0.0354236625
    floats: -0.0079518361
    floats: -0.205663398
    floats: 0.0931541324
    floats: 0.0241739713
    floats: 0.0894040838
    floats: 0.0227668416
    floats: -0.0405229479
    floats: 0.0265881624
    floats: 0.0108111454
    floats: 0.00172034919
    floats: -0.0184329972
    floats: 0.0183259211
    floats: 0.105373971
    floats: 0.0219044369
    floats: 0.0285858978
    floats: 0.03436023
    floats: 0.0205307398
    floats: -0.0289258901
    floats: 0.0186225437
    floats: 0.0989162624
    floats: -0.000972151291
    floats: 0.0213011745
    floats: 0.0415056273
    floats: 0.0156554282
    floats: 0.0192306209
    floats: 0.130387038
    floats: 0.167131037
    floats: 0.0120577654
    floats: 0.0264188554
    floats: -0.0812629312
    floats: 0.0632648617
    floats: 0.00889738742
    floats: -0.00184722536
    floats: 0.0715448409
    floats: 0.0936929509
    floats: 0.0087514
    floats: -0.0095110815
    floats: -0.110420585
    floats: -0.0206462014
    floats: 0.0315944813
    floats: -0.0263114609
    floats: 0.00777354464
    floats: 0.132093176
    floats: -0.0129405018
    floats: -0.0390806533
    floats: 0.0749421343
    floats: -0.00728956424
    floats: 0.0293911491
    floats: 0.0671720356
    floats: 0.0618466586
    floats: -0.0303522833
    floats: 0.023949232
    floats: -0.10037116
  }
}
op {
  output: "res2b_branch2a_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 64
    ints: 3
    ints: 3
  }
}
op {
  output: "res2b_branch2a_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2a_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2a_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2a_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2a_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.187967226
    floats: 0.172742337
    floats: 0.161221102
    floats: 0.197695702
    floats: 0.243800133
    floats: 0.115877777
    floats: 0.16920121
    floats: 0.104218461
    floats: 0.177946106
    floats: 0.171817124
    floats: 0.133962184
    floats: 0.176288918
    floats: 0.156738788
    floats: 0.213000059
    floats: 0.197582617
    floats: 0.161792308
    floats: 0.161548257
    floats: 0.175118208
    floats: 0.137614906
    floats: 0.197191581
    floats: 0.148658052
    floats: 0.113722712
    floats: 0.15292348
    floats: 0.200410903
    floats: 0.120341323
    floats: 0.182290629
    floats: 0.165033534
    floats: 0.106424592
    floats: 0.0971095264
    floats: 0.153364882
    floats: 0.177486315
    floats: 0.102924637
    floats: 0.123625696
    floats: 0.11503458
    floats: 0.22740984
    floats: 0.165059865
    floats: 0.169108063
    floats: 0.18081823
    floats: 0.164369151
    floats: 0.173848435
    floats: 0.158297613
    floats: 0.166817024
    floats: 0.125550047
    floats: 0.148334846
    floats: 0.186545759
    floats: 0.119438097
    floats: 0.201803699
    floats: 0.167283669
    floats: 0.150114805
    floats: 0.14520514
    floats: 0.144939348
    floats: 0.12993443
    floats: 0.197532356
    floats: 0.156844839
    floats: 0.186523214
    floats: 0.146303087
    floats: 0.153729126
    floats: 0.150963202
    floats: 0.191338494
    floats: 0.11529655
    floats: 0.246811405
    floats: 0.175729558
    floats: 0.166967317
    floats: 0.165057153
  }
}
op {
  output: "res2b_branch2a_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: -0.11740917
    floats: -0.0273984894
    floats: -0.0237161014
    floats: -0.0830220953
    floats: -0.1951067
    floats: 0.123900637
    floats: -0.131123215
    floats: 0.144137815
    floats: -0.177446604
    floats: -0.116208903
    floats: -0.00514315302
    floats: -0.0290755909
    floats: -0.0450162403
    floats: -0.123602107
    floats: -0.0787364
    floats: 0.00427455222
    floats: -0.110060014
    floats: -0.0412365459
    floats: -0.0366610438
    floats: -0.0255018342
    floats: 0.0384438671
    floats: 0.0796559826
    floats: 0.00838121399
    floats: -0.134223104
    floats: 0.0618228465
    floats: -0.0624313131
    floats: -0.0196554605
    floats: 0.185047641
    floats: 0.202914819
    floats: 0.00579597801
    floats: -0.0664248168
    floats: 0.16656974
    floats: 0.095608443
    floats: 0.0839456916
    floats: -0.0931798667
    floats: 0.00646556169
    floats: 0.00267315679
    floats: -0.105543099
    floats: -0.0648359135
    floats: -0.17348811
    floats: -0.0637591258
    floats: -0.0960149318
    floats: -0.114605978
    floats: -0.0516411848
    floats: -0.0403452665
    floats: 0.0796030313
    floats: -0.078922905
    floats: 0.0131007945
    floats: 0.0268077962
    floats: -0.111049786
    floats: -0.149744213
    floats: -0.038740471
    floats: -0.108557783
    floats: -0.050546106
    floats: -0.0118428366
    floats: -0.0357929915
    floats: -0.0687280744
    floats: -0.132532641
    floats: -0.151880577
    floats: 0.0375105031
    floats: -0.184412271
    floats: -0.0511758253
    floats: -0.0976837873
    floats: -0.037091624
  }
}
op {
  output: "res2b_branch2b_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 64
    ints: 3
    ints: 3
  }
}
op {
  output: "res2b_branch2b_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2b_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2b_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2b_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "res2b_branch2b_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.238569096
    floats: 0.233675241
    floats: 0.129026443
    floats: 0.22612676
    floats: 0.198118761
    floats: 0.0599551648
    floats: 0.216868863
    floats: 0.312533259
    floats: 0.161394641
    floats: 0.143232241
    floats: 0.1912992
    floats: 0.261331648
    floats: 0.195333347
    floats: 0.0674042478
    floats: 0.219291434
    floats: 0.213238433
    floats: 0.207123786
    floats: 0.128601238
    floats: 0.13213636
    floats: 0.167920128
    floats: 0.30446884
    floats: 0.149414644
    floats: 0.245719463
    floats: 0.366964161
    floats: 0.116347559
    floats: 0.191177249
    floats: 0.239157081
    floats: 0.149230555
    floats: 0.227015525
    floats: 0.0990900695
    floats: 0.108648255
    floats: 0.102529846
    floats: 0.168152153
    floats: 0.205190092
    floats: 0.298579097
    floats: 0.163600296
    floats: 0.139818311
    floats: 0.018357439
    floats: 0.120246448
    floats: 0.149361446
    floats: 0.328541189
    floats: 0.16391471
    floats: 0.220979854
    floats: 0.165208742
    floats: 0.0620052554
    floats: 0.0890680104
    floats: 0.161903307
    floats: 0.244477838
    floats: 0.212661743
    floats: 0.218478426
    floats: 0.244967908
    floats: 0.168780059
    floats: 0.265746921
    floats: 0.10290321
    floats: 0.275167674
    floats: 0.316898048
    floats: 0.130269319
    floats: 0.120752752
    floats: 0.242379591
    floats: 0.0728266686
    floats: 0.0640862361
    floats: 0.235593826
    floats: 0.125075921
    floats: 0.152201504
  }
}
op {
  output: "res2b_branch2b_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.0234685075
    floats: -0.0448105745
    floats: 0.087860994
    floats: 0.0599404275
    floats: -0.110567667
    floats: 0.0190631896
    floats: -0.101845101
    floats: -0.0900694206
    floats: 0.188082039
    floats: -0.0136235729
    floats: 0.0825944915
    floats: -0.0194490105
    floats: 0.0688904822
    floats: -0.0327583179
    floats: -0.176424325
    floats: -0.368404746
    floats: -0.0741768926
    floats: -0.0378751494
    floats: 0.0653424188
    floats: -0.0907137543
    floats: -0.0144516667
    floats: 0.00303822942
    floats: -0.0298412722
    floats: -0.180999279
    floats: 0.0563739352
    floats: 0.0661618486
    floats: -0.141112179
    floats: -0.0102019059
    floats: 0.00957804732
    floats: 0.0599077567
    floats: 0.0329553634
    floats: 0.0245723687
    floats: -0.138228044
    floats: 0.0405835286
    floats: -0.0175318047
    floats: 0.0099820029
    floats: 0.00343365874
    floats: 0.0127164517
    floats: -0.10268227
    floats: 0.0356773287
    floats: -0.199744046
    floats: -0.0681177601
    floats: -0.0281188749
    floats: -0.0224962812
    floats: 0.120609127
    floats: -0.0171164162
    floats: 0.00782791
    floats: 0.00494442787
    floats: 0.0716778412
    floats: -0.0302085262
    floats: -0.191342682
    floats: -0.0216040574
    floats: -0.012045227
    floats: -0.0705916
    floats: 0.004940568
    floats: -0.145104066
    floats: 0.0498850383
    floats: 0.0933299
    floats: -0.189113721
    floats: 0.0964031145
    floats: 0.0459720306
    floats: 0.146311715
    floats: -0.0840298086
    floats: 0.0811745748
  }
}
op {
  output: "res3a_branch1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 64
    ints: 1
    ints: 1
  }
}
op {
  output: "res3a_branch1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.0712050796
    floats: 0.139127254
    floats: 0.114115432
    floats: 0.0697259232
    floats: 0.0977624133
    floats: 0.0806463435
    floats: 0.022602031
    floats: 0.105686426
    floats: 0.0573883057
    floats: 0.0553212315
    floats: 0.194738224
    floats: 0.0376082212
    floats: 0.0809531286
    floats: 0.196802437
    floats: 0.132485569
    floats: 0.0266230106
    floats: 0.130858973
    floats: 0.0346110389
    floats: 0.159525439
    floats: 0.0488372296
    floats: 0.0322581157
    floats: 0.198409691
    floats: 0.0791444331
    floats: 0.0609177426
    floats: 0.0349746421
    floats: 0.113473929
    floats: 0.0251087435
    floats: 0.0582172871
    floats: 0.063999854
    floats: 0.204511419
    floats: 0.151991159
    floats: 0.0494492427
    floats: 0.0581778511
    floats: 0.132779166
    floats: 0.00295550073
    floats: 0.0353324488
    floats: 0.043569196
    floats: 0.110589035
    floats: 0.0450955071
    floats: 0.0804868639
    floats: 0.133428469
    floats: 0.078310661
    floats: 0.0395572633
    floats: 0.0424349569
    floats: 0.0550075434
    floats: 0.124105163
    floats: 0.0723798349
    floats: 0.0409209952
    floats: 0.10274855
    floats: 0.0260183141
    floats: 0.0372622833
    floats: 0.00108877488
    floats: 0.070278652
    floats: 0.0912114754
    floats: 0.0438450947
    floats: 0.123554021
    floats: 0.0647544935
    floats: 0.201542377
    floats: 0.118704312
    floats: 0.112106405
    floats: 0.0194517858
    floats: 0.0766226947
    floats: 0.046188388
    floats: 0.0894147307
    floats: 0.18301852
    floats: 0.0422893129
    floats: 0.163138852
    floats: 0.0252213161
    floats: 0.0736440718
    floats: 0.0229575876
    floats: 0.129631937
    floats: 0.0462541766
    floats: 0.120538436
    floats: 0.0918690413
    floats: 0.0205662698
    floats: 0.0371724293
    floats: -0.0206869692
    floats: 0.0967973396
    floats: 0.172926992
    floats: 0.0519490913
    floats: 0.0637626499
    floats: 0.0856327713
    floats: 0.0613650642
    floats: 0.0348352566
    floats: 0.0563931502
    floats: 0.054308705
    floats: 0.0473086163
    floats: 0.112228058
    floats: 0.0716077536
    floats: 0.0560281351
    floats: 0.268536657
    floats: 0.0758520812
    floats: 0.191674039
    floats: 0.0469962955
    floats: 0.158909455
    floats: 0.0624461845
    floats: 0.0440446511
    floats: 0.106522575
    floats: 0.0153891416
    floats: 0.0716084689
    floats: 0.0583469793
    floats: 0.0462334082
    floats: 0.0775357783
    floats: 0.0434573963
    floats: 0.0579574704
    floats: 0.0738531575
    floats: 0.0912586525
    floats: 0.0201645233
    floats: 0.137852192
    floats: 0.0509596765
    floats: 0.0167431179
    floats: -0.05353944
    floats: 0.111811884
    floats: 0.0537091754
    floats: 0.0613581091
    floats: 0.0565622561
    floats: 0.0218921527
    floats: 0.156509563
    floats: 0.094519563
    floats: 0.0367042795
    floats: 0.0902168676
    floats: 0.0630196929
    floats: 0.0481886
    floats: 0.0491379164
    floats: 0.0442630947
    floats: 0.0523249917
    floats: 0.0612261221
    floats: 0.194607601
  }
}
op {
  output: "res3a_branch1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.0121751167
    floats: 0.106521204
    floats: 0.0436890721
    floats: -0.0909191594
    floats: -0.0571653284
    floats: 0.033098802
    floats: 0.000885298476
    floats: -0.00975558255
    floats: -0.0254638
    floats: -0.106650762
    floats: -0.0217235107
    floats: -0.0832030177
    floats: -0.0354614481
    floats: 0.0286709554
    floats: 0.0119347489
    floats: 0.048099488
    floats: 0.0351405106
    floats: -0.071641162
    floats: 0.00425344706
    floats: 0.0672802851
    floats: -0.0126897
    floats: -0.195964381
    floats: -0.0720362365
    floats: -0.0524783768
    floats: 0.0440124497
    floats: -0.0527842306
    floats: 0.0262179524
    floats: -0.0630840585
    floats: -0.00715757813
    floats: -0.0342178307
    floats: -0.00471636374
    floats: -0.0892192349
    floats: -0.0412031412
    floats: 0.00064856041
    floats: -0.00463901786
    floats: 0.0394165367
    floats: -0.0752137527
    floats: 0.0166901294
    floats: 0.0420801826
    floats: -0.0612318702
    floats: 0.0311853
    floats: -0.0585453361
    floats: -0.00303828088
    floats: -0.061161492
    floats: -0.0348073021
    floats: -0.130872563
    floats: -0.0559492037
    floats: -0.0790196
    floats: 0.00982628
    floats: -0.0101881456
    floats: 0.0560541451
    floats: 0.0283494126
    floats: 0.00650207885
    floats: -0.0508066937
    floats: 0.0165395662
    floats: -0.0143254772
    floats: -0.0676094815
    floats: -0.0130288852
    floats: 0.0325444974
    floats: -0.0500169583
    floats: -0.0108601907
    floats: -0.02331228
    floats: -0.0112055168
    floats: -0.162295505
    floats: 0.000648846966
    floats: 0.0285922363
    floats: 0.0695411935
    floats: -0.00938953832
    floats: -0.0577369295
    floats: 0.06685552
    floats: 0.0356970914
    floats: -0.0170743894
    floats: 0.0394431576
    floats: -0.0388412438
    floats: 0.0661889762
    floats: 0.00614375481
    floats: -0.0107450848
    floats: -0.0258737914
    floats: 0.00011316139
    floats: -0.0239563789
    floats: -0.016913278
    floats: 0.0235262662
    floats: -0.0585828
    floats: -0.0623541139
    floats: -0.0115983076
    floats: 0.00877554156
    floats: -0.0796546
    floats: -0.075573273
    floats: -0.0842739642
    floats: -0.0289898459
    floats: -0.101647273
    floats: -0.109693408
    floats: -0.00561006833
    floats: 0.0139347883
    floats: 0.0320999846
    floats: -0.00924255513
    floats: 0.0368570164
    floats: -0.027229419
    floats: 0.0440287441
    floats: -0.0120909391
    floats: -0.0150269661
    floats: 0.000439324911
    floats: -0.0851683095
    floats: -0.0753570423
    floats: -0.0417245887
    floats: 0.00771620031
    floats: -0.0333503745
    floats: 0.0402078554
    floats: -7.76573215e-05
    floats: -0.000692316331
    floats: 0.0755624846
    floats: -0.0797630921
    floats: -0.0636123344
    floats: -0.0243141968
    floats: -0.00584208127
    floats: 0.00408387976
    floats: 0.0798901543
    floats: 0.00692991354
    floats: -0.0391260274
    floats: 0.072929129
    floats: 0.0615550168
    floats: -0.0754697248
    floats: 0.0414807424
    floats: -0.0599052981
    floats: -0.0516274981
    floats: -0.0416799039
    floats: 5.02180592e-05
    floats: -4.09895365e-05
  }
}
op {
  output: "res3a_branch2a_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 64
    ints: 3
    ints: 3
  }
}
op {
  output: "res3a_branch2a_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2a_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2a_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2a_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2a_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.152760446
    floats: 0.187623441
    floats: 0.178891808
    floats: 0.162324965
    floats: 0.163897678
    floats: 0.139527619
    floats: 0.161514744
    floats: 0.18702817
    floats: 0.165504649
    floats: 0.141097143
    floats: 0.149855122
    floats: 0.158739373
    floats: 0.149576083
    floats: 0.159317702
    floats: 0.147157222
    floats: 0.164622948
    floats: 0.153654858
    floats: 0.186249956
    floats: 0.172828496
    floats: 0.199316964
    floats: 0.150184572
    floats: 0.18626529
    floats: 0.143202797
    floats: 0.156999081
    floats: 0.164617673
    floats: 0.152219534
    floats: 0.186426133
    floats: 0.175067052
    floats: 0.157130137
    floats: 0.175317466
    floats: 0.177906916
    floats: 0.162547261
    floats: 0.165164918
    floats: 0.189920664
    floats: 0.150832027
    floats: 0.159205228
    floats: 0.176971599
    floats: 0.174412027
    floats: 0.1573309
    floats: 0.157916471
    floats: 0.100797631
    floats: 0.16311124
    floats: 0.185569271
    floats: 0.157605156
    floats: 0.161329448
    floats: 0.171333283
    floats: 0.166586891
    floats: 0.179992124
    floats: 0.14864552
    floats: 0.154952347
    floats: 0.167191416
    floats: 0.187734634
    floats: 0.152915567
    floats: 0.16394107
    floats: 0.168917194
    floats: 0.153135866
    floats: 0.177328661
    floats: 0.175827682
    floats: 0.161967725
    floats: 0.162983656
    floats: 0.156439558
    floats: 0.157029837
    floats: 0.194383696
    floats: 0.153834298
    floats: 0.196743608
    floats: 0.182816669
    floats: 0.156181216
    floats: 0.163218707
    floats: 0.154438615
    floats: 0.181493863
    floats: 0.175871745
    floats: 0.153505236
    floats: 0.170232698
    floats: 0.168866202
    floats: 0.183900282
    floats: 0.166365832
    floats: 0.161649093
    floats: 0.171178862
    floats: 0.164468229
    floats: 0.162690088
    floats: 0.162189901
    floats: 0.151353344
    floats: 0.157989904
    floats: 0.172526434
    floats: 0.146240234
    floats: 0.150629282
    floats: 0.163936973
    floats: 0.171772614
    floats: 0.185659692
    floats: 0.182946
    floats: 0.165600151
    floats: 0.163812488
    floats: 0.155701801
    floats: 0.177218542
    floats: 0.144608766
    floats: 0.15518494
    floats: 0.193562627
    floats: 0.179248676
    floats: 0.165702477
    floats: 0.145733908
    floats: 0.183690652
    floats: 0.18464829
    floats: 0.155350342
    floats: 0.0931803882
    floats: 0.156771496
    floats: 0.16986309
    floats: 0.150061503
    floats: 0.1545524
    floats: 0.191795841
    floats: 0.184363067
    floats: 0.154758155
    floats: 0.180339038
    floats: 0.146996319
    floats: 0.178553626
    floats: 0.170766428
    floats: 0.170668289
    floats: 0.155768037
    floats: 0.1565869
    floats: 0.153076217
    floats: 0.178955272
    floats: 0.149307296
    floats: 0.183250383
    floats: 0.197913691
    floats: 0.162565514
    floats: 0.169671357
    floats: 0.173224211
    floats: 0.172694772
    floats: 0.165532261
  }
}
op {
  output: "res3a_branch2a_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: -0.0370120406
    floats: -0.102603503
    floats: -0.0658207387
    floats: -0.04482124
    floats: -0.0517321862
    floats: -0.044054389
    floats: -0.0658436716
    floats: -0.0904728919
    floats: -0.0185596477
    floats: -0.0303893909
    floats: -0.0239052977
    floats: -0.0388384126
    floats: -0.0368818529
    floats: -0.0304978546
    floats: 0.0511224382
    floats: -0.0844761059
    floats: -0.0520986803
    floats: -0.106853783
    floats: -0.061138168
    floats: -0.13235
    floats: -0.0412221141
    floats: -0.0919722393
    floats: -0.0333768241
    floats: -0.0318211503
    floats: -0.0525824316
    floats: -0.0759250745
    floats: -0.0660925731
    floats: -0.0722654313
    floats: -0.0521692894
    floats: -0.0673981085
    floats: -0.0745530501
    floats: -0.0517879277
    floats: -0.03916521
    floats: -0.0748290718
    floats: -0.0503152944
    floats: -0.042047292
    floats: -0.122485757
    floats: -0.118884765
    floats: -0.0982429609
    floats: -0.0653160885
    floats: 0.131858647
    floats: -0.036949221
    floats: -0.102769695
    floats: -0.0477457531
    floats: -0.0360270403
    floats: -0.0508802123
    floats: -0.0551741049
    floats: -0.0604175776
    floats: -0.0341147818
    floats: -0.0254530609
    floats: -0.058185894
    floats: -0.0938331559
    floats: -0.0282714479
    floats: -0.102490097
    floats: -0.0501929708
    floats: -0.0440956
    floats: -0.153033063
    floats: -0.073488988
    floats: -0.0369277671
    floats: -0.0522717237
    floats: -0.0379209705
    floats: -0.0308920871
    floats: -0.0743414685
    floats: -0.02141154
    floats: -0.103598155
    floats: -0.0969268829
    floats: -0.0593120828
    floats: -0.0484683849
    floats: -0.0544841327
    floats: -0.0650066286
    floats: -0.0606579073
    floats: -0.0375389531
    floats: -0.0900544152
    floats: -0.0681477
    floats: -0.0920776725
    floats: -0.0835214
    floats: -0.0577657074
    floats: -0.0774828792
    floats: -0.0383834951
    floats: -0.0398853831
    floats: -0.0571603
    floats: -0.048037786
    floats: -0.0260208659
    floats: -0.0623998493
    floats: -0.0373784751
    floats: -0.034559954
    floats: -0.0571401641
    floats: -0.0684756637
    floats: -0.0717793778
    floats: -0.112608567
    floats: -0.052858647
    floats: -0.0540928766
    floats: -0.0394029059
    floats: -0.0752248615
    floats: -0.0329906158
    floats: -0.0379057042
    floats: -0.140449613
    floats: -0.0925067291
    floats: -0.0452742763
    floats: 0.00313910679
    floats: -0.0440887772
    floats: -0.0966430679
    floats: -0.0389841907
    floats: 0.298354208
    floats: -0.0222177338
    floats: -0.0283321869
    floats: -0.0221206788
    floats: -0.0908364877
    floats: -0.0817794129
    floats: -0.0491441414
    floats: -0.0408499762
    floats: -0.114307009
    floats: 0.0159849338
    floats: -0.0647598282
    floats: -0.0691826716
    floats: -0.0517812558
    floats: -0.0337980278
    floats: -0.048067905
    floats: -0.0168494321
    floats: -0.0820213705
    floats: -0.0485727713
    floats: -0.101642177
    floats: -0.127043605
    floats: -0.0776287541
    floats: -0.0640199706
    floats: -0.0860288218
    floats: -0.0882362798
    floats: -0.0575995669
  }
}
op {
  output: "res3a_branch2b_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 128
    ints: 3
    ints: 3
  }
}
op {
  output: "res3a_branch2b_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2b_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2b_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2b_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3a_branch2b_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.15909709
    floats: 0.0659530163
    floats: 0.126571938
    floats: 0.230360925
    floats: 0.210891485
    floats: 0.160517126
    floats: 0.219645366
    floats: 0.159022912
    floats: 0.231326342
    floats: 0.243035942
    floats: 0.0957486406
    floats: 0.20304057
    floats: 0.169661418
    floats: 0.059286695
    floats: 0.0718273818
    floats: 0.177677408
    floats: 0.127765104
    floats: 0.284220785
    floats: 0.0870464519
    floats: 0.111866191
    floats: 0.282375336
    floats: 0.185222134
    floats: 0.221536085
    floats: 0.196591705
    floats: 0.230976447
    floats: 0.19015798
    floats: 0.196445182
    floats: 0.226126224
    floats: 0.173116043
    floats: 0.116059043
    floats: 0.0977604464
    floats: 0.204822794
    floats: 0.168432161
    floats: 0.196445614
    floats: 0.175918639
    floats: 0.239544913
    floats: 0.230464965
    floats: 0.138218299
    floats: 0.177721009
    floats: 0.219491422
    floats: 0.0597288869
    floats: 0.222508952
    floats: 0.203589439
    floats: 0.276432782
    floats: 0.221264556
    floats: 0.21798262
    floats: 0.186875239
    floats: 0.158301726
    floats: 0.16255635
    floats: 0.198485911
    floats: 0.226618528
    floats: 0.165747166
    floats: 0.168380603
    floats: 0.208230987
    floats: 0.180313021
    floats: 0.122559048
    floats: 0.189708099
    floats: 0.0795321465
    floats: 0.103257164
    floats: 0.161025032
    floats: 0.190395549
    floats: 0.185890257
    floats: 0.156344429
    floats: 0.221250847
    floats: 0.0920156315
    floats: 0.168472156
    floats: 0.0522716455
    floats: 0.200327083
    floats: 0.221721575
    floats: 0.158778235
    floats: 0.145119101
    floats: 0.184571907
    floats: 0.107025571
    floats: 0.173632294
    floats: 0.143658742
    floats: 0.198244706
    floats: 0.187895015
    floats: 0.203741342
    floats: 0.052110251
    floats: 0.171815038
    floats: 0.186949834
    floats: 0.156337053
    floats: 0.284949839
    floats: 0.241470262
    floats: 0.203005731
    floats: 0.178290576
    floats: 0.236876294
    floats: 0.187171027
    floats: 0.239605069
    floats: 0.201812282
    floats: 0.154120177
    floats: 0.242800817
    floats: 0.0595715344
    floats: 0.217604578
    floats: 0.078273
    floats: 0.178479284
    floats: 0.173351765
    floats: 0.159123629
    floats: 0.148746222
    floats: 0.16739054
    floats: 0.204320297
    floats: 0.201886266
    floats: 0.23207961
    floats: 0.219010741
    floats: 0.191870987
    floats: 0.143881887
    floats: 0.191462114
    floats: 0.144507557
    floats: 0.0806734487
    floats: 0.226401299
    floats: 0.155674174
    floats: 0.334375381
    floats: 0.178275511
    floats: 0.171604276
    floats: 0.192164212
    floats: 0.162791118
    floats: 0.131452456
    floats: 0.0700298101
    floats: 0.191354603
    floats: 0.149225861
    floats: 0.0975984558
    floats: 0.229307964
    floats: 0.215622425
    floats: 0.174852416
    floats: 0.224674195
    floats: 0.219049796
    floats: 0.156714097
    floats: 0.0660102144
  }
}
op {
  output: "res3a_branch2b_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.0121751167
    floats: 0.106521204
    floats: 0.0436890721
    floats: -0.0909191594
    floats: -0.0571653284
    floats: 0.033098802
    floats: 0.000885298476
    floats: -0.00975558255
    floats: -0.0254638
    floats: -0.106650762
    floats: -0.0217235107
    floats: -0.0832030177
    floats: -0.0354614481
    floats: 0.0286709554
    floats: 0.0119347489
    floats: 0.048099488
    floats: 0.0351405106
    floats: -0.071641162
    floats: 0.00425344706
    floats: 0.0672802851
    floats: -0.0126897
    floats: -0.195964381
    floats: -0.0720362365
    floats: -0.0524783768
    floats: 0.0440124497
    floats: -0.0527842306
    floats: 0.0262179524
    floats: -0.0630840585
    floats: -0.00715757813
    floats: -0.0342178307
    floats: -0.00471636374
    floats: -0.0892192349
    floats: -0.0412031412
    floats: 0.00064856041
    floats: -0.00463901786
    floats: 0.0394165367
    floats: -0.0752137527
    floats: 0.0166901294
    floats: 0.0420801826
    floats: -0.0612318702
    floats: 0.0311853
    floats: -0.0585453361
    floats: -0.00303828088
    floats: -0.061161492
    floats: -0.0348073021
    floats: -0.130872563
    floats: -0.0559492037
    floats: -0.0790196
    floats: 0.00982628
    floats: -0.0101881456
    floats: 0.0560541451
    floats: 0.0283494126
    floats: 0.00650207885
    floats: -0.0508066937
    floats: 0.0165395662
    floats: -0.0143254772
    floats: -0.0676094815
    floats: -0.0130288852
    floats: 0.0325444974
    floats: -0.0500169583
    floats: -0.0108601907
    floats: -0.02331228
    floats: -0.0112055168
    floats: -0.162295505
    floats: 0.000648846966
    floats: 0.0285922363
    floats: 0.0695411935
    floats: -0.00938953832
    floats: -0.0577369295
    floats: 0.06685552
    floats: 0.0356970914
    floats: -0.0170743894
    floats: 0.0394431576
    floats: -0.0388412438
    floats: 0.0661889762
    floats: 0.00614375481
    floats: -0.0107450848
    floats: -0.0258737914
    floats: 0.00011316139
    floats: -0.0239563789
    floats: -0.016913278
    floats: 0.0235262662
    floats: -0.0585828
    floats: -0.0623541139
    floats: -0.0115983076
    floats: 0.00877554156
    floats: -0.0796546
    floats: -0.075573273
    floats: -0.0842739642
    floats: -0.0289898459
    floats: -0.101647273
    floats: -0.109693408
    floats: -0.00561006833
    floats: 0.0139347883
    floats: 0.0320999846
    floats: -0.00924255513
    floats: 0.0368570164
    floats: -0.027229419
    floats: 0.0440287441
    floats: -0.0120909391
    floats: -0.0150269661
    floats: 0.000439324911
    floats: -0.0851683095
    floats: -0.0753570423
    floats: -0.0417245887
    floats: 0.00771620031
    floats: -0.0333503745
    floats: 0.0402078554
    floats: -7.76573215e-05
    floats: -0.000692316331
    floats: 0.0755624846
    floats: -0.0797630921
    floats: -0.0636123344
    floats: -0.0243141968
    floats: -0.00584208127
    floats: 0.00408387976
    floats: 0.0798901543
    floats: 0.00692991354
    floats: -0.0391260274
    floats: 0.072929129
    floats: 0.0615550168
    floats: -0.0754697248
    floats: 0.0414807424
    floats: -0.0599052981
    floats: -0.0516274981
    floats: -0.0416799039
    floats: 5.02180592e-05
    floats: -4.09895365e-05
  }
}
op {
  output: "res3b_branch2a_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 128
    ints: 3
    ints: 3
  }
}
op {
  output: "res3b_branch2a_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3b_branch2a_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3b_branch2a_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3b_branch2a_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res3b_branch2a_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.167194948
    floats: 0.127799422
    floats: 0.17823121
    floats: 0.130710199
    floats: 0.139338538
    floats: 0.141794324
    floats: 0.147348493
    floats: 0.170524344
    floats: 0.127602249
    floats: 0.141517669
    floats: 0.158598751
    floats: 0.184487239
    floats: 0.182508796
    floats: 0.16113627
    floats: 0.180645093
    floats: 0.191948876
    floats: 0.196832895
    floats: 0.179910883
    floats: 0.162524775
    floats: 0.16395174
    floats: 0.139645651
    floats: 0.141208008
    floats: 0.153186247
    floats: 0.127331316
    floats: 0.169335768
    floats: 0.121985219
    floats: 0.185934901
    floats: 0.154603645
    floats: 0.135127231
    floats: 0.172269791
    floats: 0.163018733
    floats: 0.147590026
    floats: 0.176675946
    floats: 0.158976346
    floats: 0.165693521
    floats: 0.19651854
    floats: 0.153636783
    floats: 0.197342411
    floats: 0.144220367
    floats: 0.151740581
    floats: 0.170127779
    floats: 0.122073211
    floats: 0.178181946
    floats: 0.207161576
    floats: 0.126293719
    floats: 0.165912509
    floats: 0.189357251
    floats: 0.180456042
    floats: 0.169213757
    floats: 0.180152878
    floats: 0.178448305
    floats: 0.19783473
    floats: 0.176790193
    floats: 0.172316104
    floats: 0.184055284
    floats: 0.156908691
    floats: 0.18476069
    floats: 0.155712545
    floats: 0.173932299
    floats: 0.200379357
    floats: 0.190980643
    floats: 0.137691423
    floats: 0.21071595
    floats: 0.166658059
    floats: 0.144840345
    floats: 0.19753769
    floats: 0.147344887
    floats: 0.155447885
    floats: 0.127473742
    floats: 0.157416269
    floats: 0.188497648
    floats: 0.141598552
    floats: 0.151353315
    floats: 0.143916368
    floats: 0.173105717
    floats: 0.127081275
    floats: 0.157789856
    floats: 0.17372565
    floats: 0.168353572
    floats: 0.192719564
    floats: 0.159238651
    floats: 0.131693304
    floats: 0.158294663
    floats: 0.18461892
    floats: 0.176158234
    floats: 0.175335154
    floats: 0.146836966
    floats: 0.131425261
    floats: 0.153459057
    floats: 0.185695842
    floats: 0.193077415
    floats: 0.164421096
    floats: 0.196997896
    floats: 0.122630373
    floats: 0.170509487
    floats: 0.160563082
    floats: 0.216495186
    floats: 0.181839779
    floats: 0.126903132
    floats: 0.160712853
    floats: 0.180563152
    floats: 0.138200521
    floats: 0.150723696
    floats: 0.163091749
    floats: 0.196410611
    floats: 0.159751207
    floats: 0.131367847
    floats: 0.124569274
    floats: 0.176343173
    floats: 0.137319252
    floats: 0.195940197
    floats: 0.159163341
    floats: 0.160869122
    floats: 0.173513129
    floats: 0.129030779
    floats: 0.133271709
    floats: 0.158808783
    floats: 0.170483515
    floats: 0.163461357
    floats: 0.158945233
    floats: 0.149778441
    floats: 0.158271283
    floats: 0.171840459
    floats: 0.121006094
    floats: 0.147254333
    floats: 0.202609614
    floats: 0.156130821
    floats: 0.151124656
  }
}
op {
  output: "res3b_branch2a_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: -0.122931153
    floats: -0.0493020788
    floats: -0.170075089
    floats: -0.0232889783
    floats: -0.0200528353
    floats: -0.0448178574
    floats: -0.0876109153
    floats: -0.0845438913
    floats: -0.070182167
    floats: -0.122295082
    floats: -0.136033982
    floats: -0.138507843
    floats: -0.113516919
    floats: -0.132570654
    floats: -0.135277763
    floats: -0.151509672
    floats: -0.228455037
    floats: -0.157360405
    floats: -0.175718948
    floats: -0.16620028
    floats: -0.0597416461
    floats: -0.12258935
    floats: -0.182125315
    floats: -0.123689488
    floats: -0.115139134
    floats: -0.0910937935
    floats: -0.13341257
    floats: -0.0898666456
    floats: -0.0888605714
    floats: -0.134590492
    floats: -0.0789871663
    floats: -0.14034763
    floats: -0.159786895
    floats: -0.102838777
    floats: -0.166110903
    floats: -0.185866833
    floats: -0.0642663762
    floats: -0.168254301
    floats: -0.0677060932
    floats: -0.0716806725
    floats: -0.0658869296
    floats: -0.129331827
    floats: -0.137054354
    floats: -0.223858729
    floats: -0.0528334901
    floats: -0.0971996263
    floats: -0.176967576
    floats: -0.111495629
    floats: -0.161787212
    floats: -0.119884789
    floats: -0.1488197
    floats: -0.205255881
    floats: -0.159905
    floats: -0.11856138
    floats: -0.1368085
    floats: -0.130273283
    floats: -0.163877815
    floats: -0.0508337393
    floats: -0.178423092
    floats: -0.175472
    floats: -0.194847867
    floats: -0.0206876136
    floats: -0.208366022
    floats: -0.0730443299
    floats: -0.038560275
    floats: -0.13313736
    floats: -0.0807929561
    floats: -0.0789127648
    floats: -0.148191974
    floats: -0.157451376
    floats: -0.115237087
    floats: -0.0694429502
    floats: -0.131326243
    floats: -0.110401459
    floats: -0.148158282
    floats: -0.0516178161
    floats: -0.166216597
    floats: -0.114685073
    floats: -0.0832301229
    floats: -0.202852353
    floats: -0.159132183
    floats: -0.0788498595
    floats: -0.0806131884
    floats: -0.200561985
    floats: -0.183788121
    floats: -0.187614799
    floats: -0.208499745
    floats: -0.0777104646
    floats: -0.087118946
    floats: -0.209359214
    floats: -0.216387779
    floats: -0.115685217
    floats: -0.320043802
    floats: -0.0511869043
    floats: -0.116994552
    floats: -0.133938357
    floats: -0.195099115
    floats: -0.153316498
    floats: -0.131704554
    floats: -0.112726338
    floats: -0.129492968
    floats: -0.215906933
    floats: -0.0926001221
    floats: -0.0973335728
    floats: -0.174919218
    floats: -0.189888299
    floats: -0.0764585361
    floats: -0.0793745667
    floats: -0.0915732384
    floats: -0.0482061468
    floats: -0.111927517
    floats: -0.07514631
    floats: -0.0881139338
    floats: -0.12638931
    floats: -0.0814425647
    floats: -0.064435415
    floats: -0.155455261
    floats: -0.0773340836
    floats: -0.0791477785
    floats: -0.0722614676
    floats: -0.0810890347
    floats: -0.0703351274
