op {
  output: "conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 3
    ints: 7
    ints: 7
  }
}
op {
  output: "conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.237244576
    floats: 0.246489555
    floats: 0.273547351
    floats: 0.272168666
    floats: 0.225331426
    floats: 0.247852787
    floats: 0.226192713
    floats: 0.340196729
    floats: 0.233102843
    floats: 0.256356984
    floats: 0.227707088
    floats: 0.211581677
    floats: 0.243950501
    floats: 0.267387271
    floats: 0.260192215
    floats: 0.3601318
    floats: 5.08705966e-09
    floats: 0.230741829
    floats: 0.27495575
    floats: 0.22267887
    floats: 0.397470683
    floats: 0.320286423
    floats: 0.218449205
    floats: 0.19488126
    floats: 0.24905017
    floats: 0.223170981
    floats: 0.232406214
    floats: 0.331893772
    floats: 0.223535478
    floats: 0.246786758
    floats: 0.217002
    floats: 0.288289487
    floats: 0.283775359
    floats: 0.315692961
    floats: 0.341284096
    floats: 0.283030719
    floats: 0.0591162294
    floats: 0.000799483445
    floats: 0.274398565
    floats: 0.264978766
    floats: 0.271157473
    floats: 0.253703922
    floats: 0.216955289
    floats: 0.222192109
    floats: 3.099486e-09
    floats: 6.32602415e-09
    floats: 0.274246842
    floats: 0.228322953
    floats: 6.33702468e-09
    floats: 0.214638546
    floats: 0.212138534
    floats: 4.63381666e-10
    floats: 0.0481163822
    floats: 0.223703802
    floats: 0.232583076
    floats: 0.0948725641
    floats: 0.487759441
    floats: 0.317674816
    floats: 0.263297647
    floats: 0.232294396
    floats: 0.238398314
    floats: 0.348936945
    floats: 0.300783306
    floats: 0.282138
  }
}
op {
  output: "conv1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 0.133255884
    floats: 0.154224381
    floats: 0.141283497
    floats: 0.108177468
    floats: 0.258504778
    floats: 0.142220899
    floats: 0.211578488
    floats: 0.148308992
    floats: 0.241442338
    floats: 0.277855217
    floats: 0.265562475
    floats: 0.212299302
    floats: 0.111373544
    floats: 0.302090138
    floats: 0.26422298
    floats: 0.146987915
    floats: -4.55352804e-08
    floats: 0.276662022
    floats: 0.280185074
    floats: 0.0913686156
    floats: 0.806856811
    floats: 0.229830131
    floats: 0.202475354
    floats: 0.209161803
    floats: 0.553597212
    floats: 0.210418016
    floats: 0.237384662
    floats: -0.177016512
    floats: 0.183304086
    floats: 0.215753883
    floats: 0.201713935
    floats: 0.151926219
    floats: 0.200140089
    floats: 0.33431831
    floats: 0.143519178
    floats: 0.338145524
    floats: -0.0383845717
    floats: -0.000736574118
    floats: 0.305602044
    floats: 0.0786426216
    floats: 0.321707
    floats: 0.0977642238
    floats: 0.677221954
    floats: 0.216778755
    floats: -1.74626678e-08
    floats: -4.05045526e-08
    floats: 0.251867831
    floats: 0.255879
    floats: -3.28625731e-08
    floats: 0.206308156
    floats: 0.235283956
    floats: -2.37985809e-08
    floats: -0.0308957249
    floats: 0.17574814
    floats: 0.202801496
    floats: -0.0647477582
    floats: 1.00409853
    floats: 0.930380762
    floats: 0.162617624
    floats: 0.246748105
    floats: 0.189871728
    floats: 0.157654241
    floats: -0.0817665234
    floats: 0.277131259
  }
}
op {
  output: "res1_conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 64
    ints: 1
    ints: 1
  }
}
op {
  output: "res1_conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.270952016
    floats: 0.127058551
    floats: 0.26265955
    floats: 0.116985805
    floats: 0.153509334
    floats: 0.261929214
    floats: 0.143453807
    floats: 0.0799647272
    floats: 0.160535604
    floats: 0.0891491249
    floats: 0.147955
    floats: 0.100539155
    floats: 0.170136884
    floats: 0.173977822
    floats: 0.256660044
    floats: 0.119862847
    floats: 0.272140324
    floats: 0.106993631
    floats: 0.129139379
    floats: 0.170195952
    floats: 0.143771514
    floats: 0.174684107
    floats: 0.134955317
    floats: 0.244034871
    floats: 0.153159767
    floats: 0.115323849
    floats: 0.306739092
    floats: 0.15761058
    floats: 0.106945962
    floats: 0.134473518
    floats: 0.155302644
    floats: 0.175938159
    floats: 0.10378553
    floats: 0.126540661
    floats: 0.156570137
    floats: 0.342576534
    floats: 0.18472667
    floats: 0.177994698
    floats: 0.285303593
    floats: 0.151466712
    floats: 0.133937702
    floats: 0.138647258
    floats: 0.269889951
    floats: 0.212017909
    floats: 0.268197834
    floats: 0.0947816
    floats: 0.142325938
    floats: 0.0912234038
    floats: 0.159117609
    floats: 0.0600149073
    floats: 0.16238296
    floats: 0.0977909788
    floats: 0.127163306
    floats: 0.0988036245
    floats: 0.111322962
    floats: 0.0965975225
    floats: 0.206302479
    floats: 0.302165478
    floats: 0.30682
    floats: 0.221503928
    floats: 0.210004404
    floats: 0.104596123
    floats: 0.295935035
    floats: 0.118290536
    floats: 0.352150381
    floats: 0.308098584
    floats: 0.131759644
    floats: 0.295530885
    floats: 0.278023094
    floats: 0.103895076
    floats: 0.0616368838
    floats: 0.353762567
    floats: 0.115875222
    floats: 0.158047989
    floats: 0.107013874
    floats: 0.158614531
    floats: 0.287082046
    floats: 0.177571967
    floats: 0.248571023
    floats: 0.242629111
    floats: 0.145286545
    floats: 0.139347106
    floats: 0.0828478783
    floats: 0.11640203
    floats: 0.257874429
    floats: 0.148079
    floats: 0.135943905
    floats: 0.100690097
    floats: 0.207828492
    floats: 0.143387452
    floats: 0.125874221
    floats: 0.242963672
    floats: 0.216233552
    floats: 0.173543707
    floats: 0.261532813
    floats: 0.188808471
    floats: 0.169257343
    floats: 0.236290768
    floats: 0.107074656
    floats: 0.128611282
    floats: 0.105747283
    floats: 0.0910134241
    floats: 0.206802353
    floats: 0.222735882
    floats: 0.249440134
    floats: 0.102721669
    floats: 0.246516153
    floats: 0.168136179
    floats: 0.115055479
    floats: 0.188991696
    floats: 0.105268352
    floats: 0.160482764
    floats: 0.122471124
    floats: 0.292066693
    floats: 0.0942812562
    floats: 0.222722501
    floats: 0.209463552
    floats: 0.178212464
    floats: 0.172083482
    floats: 0.190396085
    floats: 0.210819408
    floats: 0.143739596
    floats: 0.158729479
    floats: 0.107045226
    floats: 0.122078739
    floats: 0.0740385875
    floats: 0.147189274
    floats: 0.136777103
  }
}
op {
  output: "res1_conv1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: -0.0622425191
    floats: -0.238568351
    floats: -0.130523384
    floats: -0.0425872765
    floats: 0.0489601232
    floats: -0.151065856
    floats: -0.0275693107
    floats: 0.0563028827
    floats: -0.0155497333
    floats: 0.102388121
    floats: 0.0692890584
    floats: -0.0113074267
    floats: -0.017333718
    floats: 0.102302156
    floats: -0.0482690148
    floats: -0.0130082816
    floats: -0.108204007
    floats: 0.117431238
    floats: 0.0716576502
    floats: -0.0481212474
    floats: 0.0359333046
    floats: 0.0280130543
    floats: 0.102701008
    floats: -0.0381693579
    floats: 0.0706143603
    floats: 0.307565659
    floats: -0.0497153886
    floats: 0.195718259
    floats: 0.029942004
    floats: 0.0769324228
    floats: 0.0234414227
    floats: -0.0433476754
    floats: 0.125395834
    floats: -0.100024492
    floats: 0.12298958
    floats: -0.138605
    floats: 0.0325505324
    floats: -0.0342504755
    floats: -0.107063949
    floats: 0.00371321035
    floats: 0.0346471779
    floats: 0.0838518143
    floats: -0.0885208
    floats: -0.0446646512
    floats: -0.0766938776
    floats: 0.246419132
    floats: -0.0640557706
    floats: 0.197501451
    floats: -0.0594468266
    floats: 0.0659437329
    floats: 0.36625874
    floats: 0.136658162
    floats: 0.0101546915
    floats: -0.024062654
    floats: 0.0924418494
    floats: 0.170028374
    floats: 0.0126625299
    floats: -0.181629851
    floats: -0.0874969363
    floats: -0.102655835
    floats: -0.0199246164
    floats: 0.0757386
    floats: -0.144479573
    floats: 0.0767422095
    floats: -0.12691237
    floats: -0.106251843
    floats: -0.0293144118
    floats: -0.113314711
    floats: -0.0774980262
    floats: 0.0788382068
    floats: -0.0144376745
    floats: -0.0914673209
    floats: -0.0235575773
    floats: 0.118076004
    floats: 0.0641876757
    floats: -0.0408256054
    floats: -0.150282159
    floats: -0.16590853
    floats: -0.0829791725
    floats: -0.0320746601
    floats: -0.018808106
    floats: -0.0496861711
    floats: -0.108173221
    floats: 0.0156780854
    floats: -0.084387362
    floats: 0.0329104252
    floats: 0.273807675
    floats: -0.00339642749
    floats: 0.0389467292
    floats: 0.0638021752
    floats: -0.0571113117
    floats: -0.0222365223
    floats: 0.0373571962
    floats: 0.387185305
    floats: -0.028328171
    floats: 0.20931977
    floats: 0.0081497943
    floats: -0.0669451058
    floats: -0.0291385036
    floats: 0.351321787
    floats: 0.0247912798
    floats: 0.102772437
    floats: -0.0361564569
    floats: -0.0254420955
    floats: -0.078773
    floats: 0.0634154677
    floats: -0.117818266
    floats: 0.0434843488
    floats: -0.0175843034
    floats: -0.0853529647
    floats: 0.0105061075
    floats: 0.126549497
    floats: 0.0545462817
    floats: -0.0798423514
    floats: -0.0179537758
    floats: -0.0435543321
    floats: -0.0636621416
    floats: -0.0480361059
    floats: -0.0452348031
    floats: -0.14217709
    floats: -0.0522334576
    floats: -0.107305452
    floats: -0.0684052706
    floats: 0.0208278801
    floats: 0.0722283646
    floats: -0.111805715
    floats: -0.0324312523
    floats: 0.0469708554
  }
}
op {
  output: "res1_conv2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 128
    ints: 3
    ints: 3
  }
}
op {
  output: "res1_conv2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res1_conv2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.119602434
    floats: 0.220707878
    floats: 0.177065045
    floats: 0.11237216
    floats: 0.174564615
    floats: 0.179549858
    floats: 0.125747889
    floats: 0.133882895
    floats: 0.122838624
    floats: 0.136147678
    floats: 0.146129325
    floats: 0.122388504
    floats: 0.126955062
    floats: 0.149150178
    floats: 0.137796059
    floats: 0.117360532
    floats: 0.101981111
    floats: 0.170385763
    floats: 0.14620015
    floats: 0.211522236
    floats: 0.117436551
    floats: 0.143990397
    floats: 0.151729763
    floats: 0.114396788
    floats: 0.154647678
    floats: 0.138672665
    floats: 0.186202586
    floats: 0.116919622
    floats: 0.164205924
    floats: 0.122741573
    floats: 0.157414556
    floats: 0.191338331
    floats: 0.121626548
    floats: 0.132316172
    floats: 0.128534868
    floats: 0.177317426
    floats: 0.181885123
    floats: 0.155448273
    floats: 0.154095
    floats: 0.161652952
    floats: 0.12705861
    floats: 0.109791957
    floats: 0.196282864
    floats: 0.15503338
    floats: 0.156339
    floats: 0.199059546
    floats: 0.185511529
    floats: 0.118291363
    floats: 0.132029116
    floats: 0.120008692
    floats: 0.157917112
    floats: 0.214020789
    floats: 0.134982958
    floats: 0.115158975
    floats: 0.230789945
    floats: 0.162589356
    floats: 0.118767895
    floats: 0.151003942
    floats: 0.147060886
    floats: 0.171678424
    floats: 0.128704384
    floats: 0.162089556
    floats: 0.123410203
    floats: 0.153040886
    floats: 0.169361636
    floats: 0.144184932
    floats: 0.130992
    floats: 0.163980693
    floats: 0.0692844391
    floats: 0.109977558
    floats: 0.165252969
    floats: 0.21825406
    floats: 0.114458971
    floats: 0.143714264
    floats: 0.148482099
    floats: 0.143660545
    floats: 0.136503786
    floats: 0.161308318
    floats: 0.157511547
    floats: 0.120464243
    floats: 0.186796799
    floats: 0.177909195
    floats: 0.154000878
    floats: 0.141902566
    floats: 0.147840798
    floats: 0.142524093
    floats: 0.184404194
    floats: 0.125989094
    floats: 0.120045245
    floats: 0.148410633
    floats: 0.135761991
    floats: 0.186514318
    floats: 0.161791891
    floats: 0.113429539
    floats: 0.157383919
    floats: 0.131360129
    floats: 0.215598494
    floats: 0.110279076
    floats: 0.186226726
    floats: 0.140833378
    floats: 0.199857667
    floats: 0.13139087
    floats: 0.136480525
    floats: 0.159675926
    floats: 0.172585636
    floats: 0.15560171
    floats: 0.176217884
    floats: 0.172275305
    floats: 0.0920937583
    floats: 0.115658469
    floats: 0.114587858
    floats: 0.116093017
    floats: 0.13990505
    floats: 0.140001118
    floats: 0.146126851
    floats: 0.203369275
    floats: 0.209684387
    floats: 0.135014698
    floats: 0.181933612
    floats: 0.142862588
    floats: 0.130287439
    floats: 0.127579734
    floats: 0.153991297
    floats: 0.141192317
    floats: 0.140347809
    floats: 0.132625401
    floats: 0.105072215
    floats: 0.217547014
  }
}
op {
  output: "res1_conv2_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.140769631
    floats: -0.0794527
    floats: -0.0133022638
    floats: 0.116348699
    floats: -0.132290542
    floats: -0.122661866
    floats: 0.232235342
    floats: 0.0301807355
    floats: 0.190610826
    floats: 0.295753598
    floats: -0.128605828
    floats: -0.0115984194
    floats: 0.207261041
    floats: -0.0639143214
    floats: -0.0739016235
    floats: 0.03670213
    floats: -0.0685689598
    floats: -0.112237632
    floats: 0.0660120398
    floats: 0.110415325
    floats: 0.0189121012
    floats: 0.0995258242
    floats: -0.0200854912
    floats: 0.286251456
    floats: -0.103354372
    floats: -0.0162150785
    floats: 0.0573987588
    floats: 0.0821806937
    floats: 0.0157217477
    floats: 0.0807145685
    floats: -0.0977587625
    floats: -0.162498698
    floats: 0.0572616793
    floats: 0.0601697117
    floats: 0.0471136
    floats: -0.125580654
    floats: -0.0860769525
    floats: -0.12871556
    floats: 0.302157074
    floats: -0.0939865
    floats: 0.0536458381
    floats: 0.152910888
    floats: 0.455299914
    floats: 0.118144482
    floats: -0.0653938
    floats: -0.0568614155
    floats: -0.0933432207
    floats: 0.00368506531
    floats: -0.0511900187
    floats: 0.102797382
    floats: -0.11313761
    floats: 0.442260712
    floats: 0.324763566
    floats: 0.225096881
    floats: 0.51463747
    floats: -0.0889560729
    floats: -0.0329815596
    floats: -0.119487979
    floats: -0.0686763
    floats: 0.12650609
    floats: 0.190298587
    floats: -0.10880971
    floats: 0.112400122
    floats: -0.00607554894
    floats: 0.076248236
    floats: 0.143573225
    floats: -0.0116205718
    floats: -0.0859732851
    floats: 0.114990659
    floats: 0.10017737
    floats: 0.0727233887
    floats: -0.183797151
    floats: 0.165840715
    floats: -0.0946829319
    floats: -0.0888216
    floats: -0.0684510544
    floats: 0.25108397
    floats: -0.107359454
    floats: -0.0733856112
    floats: -0.0410168581
    floats: -0.159960389
    floats: -0.0900344402
    floats: 0.0760685652
    floats: -0.142103955
    floats: 0.127962619
    floats: -0.0122948205
    floats: 0.0267937295
    floats: 0.303110272
    floats: 0.125676095
    floats: 0.0491465963
    floats: 0.058971785
    floats: -0.0431145765
    floats: 0.00158006838
    floats: 0.173255488
    floats: 0.175496459
    floats: 0.0174262077
    floats: 0.0708759
    floats: 0.0662424117
    floats: -0.0749917328
    floats: 0.146332577
    floats: -0.10884697
    floats: 0.0279844385
    floats: -0.0302854422
    floats: 0.06428653
    floats: -0.125833884
    floats: -0.0124662071
    floats: -0.099113591
    floats: 0.114132315
    floats: 0.219796032
    floats: 0.11549224
    floats: 0.0735864863
    floats: 0.208318219
    floats: 0.271663874
    floats: -0.0770916566
    floats: 0.0348740257
    floats: 0.0892198235
    floats: -0.191205442
    floats: -0.0827630684
    floats: -0.0588485971
    floats: -0.0930965766
    floats: 0.0198400412
    floats: -0.0250528157
    floats: 0.120385461
    floats: 0.272457212
    floats: 0.0197912883
    floats: -0.0361829959
    floats: 0.178141236
    floats: -0.243703336
  }
}
op {
  output: "res1_conv3_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 128
    ints: 1
    ints: 1
  }
}
op {
  output: "res1_conv3_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_conv3_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_conv3_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_conv3_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_conv3_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 0.116109662
    floats: 0.16153419
    floats: 0.187603
    floats: 0.270776153
    floats: 4.51466668e-08
    floats: 0.241437644
    floats: 0.00188831496
    floats: 0.168720707
    floats: 0.195963532
    floats: 0.00238087401
    floats: 0.162255153
    floats: -0.00563564477
    floats: 0.21613045
    floats: 0.0456363112
    floats: 0.187533796
    floats: 0.0921497121
    floats: 0.271563441
    floats: 0.137062475
    floats: 0.163181856
    floats: 0.110045277
    floats: 0.213491186
    floats: 0.0994933844
    floats: 0.278246403
    floats: 0.225561351
    floats: 0.229682267
    floats: 3.10514224e-05
    floats: 0.113987632
    floats: 0.203659147
    floats: 2.75216462e-05
    floats: 2.43719728e-06
    floats: 0.0503792092
    floats: 0.204167619
    floats: 0.00129533338
    floats: 0.289897591
    floats: 0.0448353216
    floats: 0.116039149
    floats: 0.0649414
    floats: 0.222844332
    floats: 0.280359656
    floats: 0.214668065
    floats: 0.12644355
    floats: 0.127325028
    floats: 0.259958327
    floats: 0.253035724
    floats: 0.221640185
    floats: 0.0829664618
    floats: 0.114507057
    floats: 0.14970082
    floats: 0.186443642
    floats: 5.5686105e-05
    floats: 0.119256414
    floats: 1.50859626e-06
    floats: 0.146323264
    floats: 0.167096049
    floats: 0.142667711
    floats: 0.00903377868
    floats: 0.187415928
    floats: 0.189970464
    floats: 0.00473797135
    floats: 0.0955368727
    floats: 0.227275625
    floats: 0.146877602
    floats: 0.271933436
    floats: 0.17929554
    floats: 0.0049189413
    floats: 0.238713622
    floats: 0.15326044
    floats: 0.0538035072
    floats: 3.45212866e-05
    floats: 0.145153657
    floats: 0.050231386
    floats: 0.165096
    floats: 0.260409385
    floats: 0.193443894
    floats: 6.88700766e-07
    floats: 0.142483696
    floats: 0.0110202963
    floats: 0.0339373834
    floats: 6.22033622e-05
    floats: 0.173265144
    floats: 0.219986126
    floats: 0.196892112
    floats: 0.122667
    floats: 0.00700593414
    floats: 0.0745277181
    floats: 0.246031493
    floats: 0.235982701
    floats: 0.15627189
    floats: 0.199683726
    floats: 0.0692083836
    floats: 0.142791077
    floats: 2.66818961e-06
    floats: 0.181105554
    floats: 0.136699781
    floats: 0.290059507
    floats: 0.158518791
    floats: -4.08945397e-07
    floats: 0.120389558
    floats: 0.255586743
    floats: 0.0810741335
    floats: 2.4678377e-06
    floats: 0.214935049
    floats: 0.0349241607
    floats: 0.228361502
    floats: 4.98880866e-07
    floats: 0.112564467
    floats: 0.213043109
    floats: 0.119779922
    floats: -0.0091892425
    floats: 0.233462974
    floats: 0.0912193581
    floats: 0.155350745
    floats: 0.221194193
    floats: 0.000249087112
    floats: 0.208430737
    floats: 0.236587122
    floats: 0.151421219
    floats: 0.051926747
    floats: 0.0458162
    floats: 0.188006252
    floats: 0.222504944
    floats: -6.48463447e-06
    floats: -1.22191682e-06
    floats: 0.160680726
    floats: 0.132969439
    floats: -6.04635825e-05
    floats: 0.0654768869
    floats: 0.00893897563
    floats: 0.243405312
    floats: 0.218400851
    floats: 2.67762721e-06
    floats: 0.0378124528
    floats: 0.220185712
    floats: 0.118968785
    floats: 0.211635396
    floats: 0.0829378
    floats: 0.0230077673
    floats: 0.132860944
    floats: 8.51172786e-07
    floats: 0.0958279818
    floats: 0.242263407
    floats: 0.239923954
    floats: 0.180620208
    floats: 0.252054423
    floats: 0.208887175
    floats: 0.0266713724
    floats: 0.147172973
    floats: 0.0683595315
    floats: 0.141023
    floats: 0.220846564
    floats: 0.0455713905
    floats: 0.231296465
    floats: 0.109507389
    floats: 0.28178525
    floats: 0.0657033622
    floats: 0.225948229
    floats: 0.0806551352
    floats: 0.115612879
    floats: 0.231216222
    floats: 0.241627067
    floats: 0.00505289063
    floats: 0.195902109
    floats: 0.241701558
    floats: 0.188762054
    floats: 0.164930314
    floats: 0.138292775
    floats: 0.243852556
    floats: 0.000432654109
    floats: 0.176577821
    floats: 0.239066467
    floats: 0.183457643
    floats: 5.57032308e-07
    floats: 0.0444557928
    floats: 0.186741158
    floats: 0.21895659
    floats: -0.00361233973
    floats: 0.160354853
    floats: 0.134203061
    floats: 0.137031898
    floats: 0.000757144939
    floats: 0.0613203309
    floats: 0.186404347
    floats: 0.00638586655
    floats: 0.00958972238
    floats: 0.329318583
    floats: 0.139061287
    floats: 0.218453363
    floats: 0.29089883
    floats: 0.124343835
    floats: 0.247199342
    floats: 0.127314657
    floats: 0.0914646834
    floats: 0.139664367
    floats: 0.081134133
    floats: 0.186555281
    floats: 0.0559325553
    floats: 0.00129006256
    floats: 0.0713418946
    floats: 0.192116737
    floats: 0.270095587
    floats: 0.26875037
    floats: -0.00217874558
    floats: 0.264365077
    floats: 0.134012461
    floats: 0.000157962219
    floats: 0.128297865
    floats: 0.102660976
    floats: 0.252203256
    floats: 0.26265794
    floats: 0.0195548311
    floats: 0.267758548
    floats: 0.199053109
    floats: 0.0754111558
    floats: 0.000848148833
    floats: 0.143632919
    floats: 0.0971991122
    floats: 0.221573085
    floats: 0.138588637
    floats: 0.174944893
    floats: 0.218968183
    floats: 0.077508755
    floats: 0.250652254
    floats: 0.102150656
    floats: 0.0813142
    floats: 0.122987203
    floats: 0.305147171
    floats: 0.176871955
    floats: 0.0101736616
    floats: 0.0419083424
    floats: 0.11670807
    floats: 0.199849933
    floats: 0.145052016
    floats: 0.0706029162
    floats: 0.0638809055
    floats: 0.134982467
    floats: 0.0506361276
    floats: 0.141915217
    floats: 0.191899419
    floats: 0.230890527
    floats: 0.217134356
    floats: 0.382886142
    floats: 0.100096777
    floats: 0.222023264
    floats: 0.155995831
    floats: 0.0474864207
    floats: 0.0653744787
    floats: 0.00401836447
    floats: 1.1257508e-05
    floats: 0.182928681
    floats: 0.144677296
    floats: 0.191771612
    floats: 0.215938583
    floats: 0.169004694
    floats: 0.0634541
    floats: 0.188778698
    floats: 5.31770397e-08
  }
}
op {
  output: "res1_conv3_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 0.0560013689
    floats: 0.100696884
    floats: -0.0235137455
    floats: 0.0587395541
    floats: -1.32275076e-07
    floats: 0.0830200464
    floats: 0.0198597498
    floats: 0.0230977833
    floats: 0.082990773
    floats: 0.0611737035
    floats: 0.11755278
    floats: 0.0994575843
    floats: 0.113971613
    floats: 0.0596830249
    floats: 0.0904716626
    floats: 0.0017649628
    floats: 0.0744022578
    floats: 0.0651545152
    floats: 0.0378173552
    floats: 0.0994734839
    floats: 0.0598035492
    floats: 0.0794208199
    floats: 0.0304572619
    floats: 0.050790675
    floats: 0.13974382
    floats: -0.000132504298
    floats: 0.160610616
    floats: 0.12175189
    floats: -0.000374674681
    floats: -9.44008571e-06
    floats: -0.0262517892
    floats: 0.0759769082
    floats: -0.00258302013
    floats: -0.0272224937
    floats: -0.0412491448
    floats: 0.104687862
    floats: -0.00668477314
    floats: 0.0665942058
    floats: 0.0420294143
    floats: -0.00943420548
    floats: -0.0232917015
    floats: 0.00799116772
    floats: 0.0594276935
    floats: 0.0784125775
    floats: 0.0458305776
    floats: -0.000903923705
    floats: 0.0751607865
    floats: 0.0813529789
    floats: 0.0436565727
    floats: -9.44493513e-05
    floats: -0.0102227367
    floats: -5.85034468e-06
    floats: 0.0595962964
    floats: 0.188330963
    floats: -0.0133619411
    floats: 0.0105665987
    floats: 0.012151245
    floats: 0.0654131398
    floats: 0.20631732
    floats: 0.00999005325
    floats: 0.123997398
    floats: -0.0206897892
    floats: 0.0777761266
    floats: 0.0425542109
    floats: -0.0699564
    floats: 0.170961499
    floats: 0.0473538786
    floats: 0.0357869826
    floats: -8.52248704e-05
    floats: 0.0443207026
    floats: 0.00487929257
    floats: 0.0798833221
    floats: 0.0731379464
    floats: 0.0533359088
    floats: -1.0951328e-06
    floats: 3.58877733e-05
    floats: -0.0374074355
    floats: 0.139257833
    floats: -0.000226878707
    floats: 0.0655031279
    floats: 0.0109453322
    floats: 0.0297422074
    floats: 0.00158140401
    floats: 0.133091539
    floats: -0.0032270581
    floats: 0.0660593882
    floats: -0.0259440951
    floats: 0.00106500788
    floats: 0.00855824444
    floats: 0.102046393
    floats: 0.0265572667
    floats: -8.75589285e-06
    floats: 0.0548693165
    floats: -0.0216637347
    floats: 0.10640388
    floats: 0.00769723
    floats: -0.00014866906
    floats: -0.0679592
    floats: -0.000418436161
    floats: -0.0302051101
    floats: -1.21555913e-05
    floats: 0.228381857
    floats: 0.00804786477
    floats: 0.0480041429
    floats: -1.38041855e-06
    floats: -0.0106990272
    floats: 0.0656909272
    floats: 0.0869301111
    floats: 0.0326727703
    floats: 0.0232400596
    floats: 0.00274596084
    floats: 0.0466397852
    floats: -0.127863169
    floats: -0.00251356885
    floats: 0.0325926021
    floats: 0.0168925487
    floats: 0.130599245
    floats: 0.0439454019
    floats: 0.00248580799
    floats: 0.0838366747
    floats: 0.0976619795
    floats: -0.000171250562
    floats: -4.34154845e-06
    floats: 0.0422211923
    floats: -0.00784037821
    floats: -0.00110039162
    floats: 0.0574625134
    floats: 0.0819854513
    floats: 0.0675701201
    floats: 0.0365750343
    floats: -4.04547109e-06
    floats: 0.00935749337
    floats: 0.0442305841
    floats: 0.0834504291
    floats: 0.0354934596
    floats: 0.00214879098
    floats: -0.00729686441
    floats: 0.0281413235
    floats: -2.36698179e-06
    floats: 0.0173451081
    floats: -0.0300542023
    floats: 0.0221071597
    floats: 0.0244423263
    floats: 0.035949748
    floats: 0.0509271957
    floats: 0.0375088975
    floats: 0.0318358764
    floats: 0.0342788361
    floats: -0.0109090321
    floats: 0.0343715176
    floats: -0.00970362499
    floats: 0.146572918
    floats: 0.0363447852
    floats: 0.0124065448
    floats: -0.111345932
    floats: 0.0501887761
    floats: 0.00570237311
    floats: 0.0754778236
    floats: -0.0211915392
    floats: 0.238027513
    floats: 0.0024655438
    floats: 0.0844159
    floats: 0.0125535214
    floats: 0.0182309914
    floats: -0.0148633076
    floats: 0.123409174
    floats: 0.0159537848
    floats: 0.213962689
    floats: 0.0947534814
    floats: 0.0182152484
    floats: 0.0688557327
    floats: -8.64451692e-07
    floats: -0.018589
    floats: -0.00170709717
    floats: 0.162326172
    floats: 0.0135489497
    floats: -0.0212114137
    floats: 0.0620951392
    floats: 0.0811979771
    floats: -0.00154970994
    floats: 0.0444951802
    floats: 0.104429439
    floats: -0.0144957956
    floats: 0.0887306556
    floats: 0.0457851663
    floats: 0.00506752543
    floats: 0.112939015
    floats: 0.071483
    floats: 0.0799582824
    floats: 0.0950688645
    floats: 0.0924358815
    floats: 0.049169682
    floats: 0.0652239919
    floats: 0.086593084
    floats: 0.00494448235
    floats: -0.0134492368
    floats: -0.00341774849
    floats: 0.0107796928
    floats: 0.0271950308
    floats: 0.0344093852
    floats: 0.0667642877
    floats: 0.0344098434
    floats: 0.0771713257
    floats: 0.0661325157
    floats: -0.000778421236
    floats: 0.0597798042
    floats: 0.000796241453
    floats: -0.00107121456
    floats: -0.032077767
    floats: 0.0357929
    floats: 0.0318929926
    floats: 0.134301022
    floats: 0.102371022
    floats: 0.0369970798
    floats: -0.0947044492
    floats: 0.133948177
    floats: 0.0179496873
    floats: -0.0178407189
    floats: -0.0122923069
    floats: 0.0128832469
    floats: 0.102358766
    floats: -0.0834601596
    floats: 0.0627363846
    floats: -0.0071496875
    floats: 0.0486504622
    floats: 0.129685119
    floats: 0.0880896822
    floats: 0.0909488797
    floats: 0.0573038869
    floats: 0.0883221
    floats: 0.0405201055
    floats: 0.0995726362
    floats: -0.0150663843
    floats: 0.142413974
    floats: -0.0776385739
    floats: 0.0387066416
    floats: 0.0199230686
    floats: 0.128520221
    floats: 0.0690221414
    floats: 0.0288768802
    floats: 0.0856739134
    floats: -0.065775089
    floats: 0.0235387255
    floats: 0.0346456282
    floats: 0.0208390802
    floats: 0.0280735679
    floats: 0.00380458706
    floats: -2.10459e-05
    floats: 0.0834715441
    floats: 0.0232018195
    floats: 0.0892025754
    floats: 0.160229445
    floats: 0.0183390547
    floats: -0.0372705
    floats: 0.00245543593
    floats: -1.22965332e-07
  }
}
op {
  output: "res1_match_conv_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 64
    ints: 1
    ints: 1
  }
}
op {
  output: "res1_match_conv_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_match_conv_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_match_conv_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_match_conv_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "res1_match_conv_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 0.189010695
    floats: 0.241743252
    floats: 0.355931699
    floats: 0.298780799
    floats: 5.57988535e-08
    floats: 0.200505808
    floats: 0.0663561746
    floats: 0.298641801
    floats: 0.108338431
    floats: 0.21666193
    floats: 0.187938407
    floats: 0.182806969
    floats: -0.00108466356
    floats: 0.0914626569
    floats: 0.249250323
    floats: 0.0736351907
    floats: 0.257393211
    floats: 0.141237125
    floats: 0.218723089
    floats: 0.219266579
    floats: 0.317141533
    floats: 0.13769415
    floats: 0.304855198
    floats: 0.272467762
    floats: 0.0711469129
    floats: 1.33519725e-05
    floats: 0.170299545
    floats: 0.325896084
    floats: 7.88714e-05
    floats: 2.96221174e-06
    floats: 0.0216693953
    floats: 0.202101171
    floats: 0.000210334008
    floats: 0.0151646035
    floats: 0.110822238
    floats: 0.251589864
    floats: 0.148766369
    floats: 0.283168137
    floats: 0.310337275
    floats: 0.0324342661
    floats: 0.0908022448
    floats: 0.236751646
    floats: 0.259253234
    floats: 0.355763048
    floats: 0.259749681
    floats: 0.24493818
    floats: 0.152357906
    floats: 0.212144092
    floats: 0.247018903
    floats: 7.62900436e-06
    floats: 0.0114985844
    floats: 1.74576758e-06
    floats: 0.203769699
    floats: 0.153657421
    floats: 0.138746619
    floats: 0.0595572554
    floats: 0.346421093
    floats: 0.176809609
    floats: 0.206816256
    floats: 0.143225
    floats: 0.00584117556
    floats: 0.187570214
    floats: 0.210027635
    floats: 0.30366388
    floats: 0.267636329
    floats: 0.266113371
    floats: 0.166225716
    floats: 0.23754783
    floats: 2.34780964e-05
    floats: 0.286323339
    floats: 0.0858425
    floats: 0.303965837
    floats: 0.234840944
    floats: 0.247628838
    floats: 1.26916973e-07
    floats: 0.290335506
    floats: 0.317968667
    floats: 0.309772968
    floats: 3.33640719e-06
    floats: 0.228950709
    floats: 0.327223867
    floats: 0.260794491
    floats: -0.0367898382
    floats: 0.255638719
    floats: 0.0471965857
    floats: 0.232980117
    floats: 0.0107644806
    floats: 0.193445265
    floats: 0.271497577
    floats: 0.194738254
    floats: 0.134534329
    floats: 3.51066205e-07
    floats: 0.268950194
    floats: 0.217682555
    floats: 0.306506336
    floats: 0.300173819
    floats: 6.82408136e-05
    floats: 0.156406194
    floats: 0.00818020478
    floats: 0.0899330899
    floats: 3.68919655e-06
    floats: 0.164684147
    floats: 0.381555617
    floats: 0.263748735
    floats: 3.7910354e-07
    floats: 0.162398294
    floats: 0.167021737
    floats: 0.115993857
    floats: 0.0515429862
    floats: 0.298766106
    floats: 0.260991722
    floats: 0.210369065
    floats: 0.267237335
    floats: 0.00221329276
    floats: 0.369465858
    floats: 0.130328178
    floats: 0.194842651
    floats: 0.0301854275
    floats: 0.130962312
    floats: 0.306914866
    floats: -0.00610464392
    floats: 9.29245e-05
    floats: 4.26524537e-07
    floats: 0.143465087
    floats: 0.177087
    floats: 0.000110479668
    floats: 0.29741326
    floats: 0.249922931
    floats: 0.258296579
    floats: 0.345237851
    floats: -7.25277346e-07
    floats: 0.421641797
    floats: 0.183679923
    floats: 0.0704398081
    floats: 0.143583834
    floats: 0.153904393
    floats: 0.207666889
    floats: 0.200699568
    floats: -1.29590103e-06
    floats: 0.114445642
    floats: 0.027619075
    floats: 0.198489279
    floats: 0.224789053
    floats: 0.398951977
    floats: 0.270726681
    floats: 0.153436661
    floats: 0.193728819
    floats: 0.0833764672
    floats: 0.210579947
    floats: 0.276706845
    floats: 0.0681039
    floats: 0.115929931
    floats: 0.248050362
    floats: 0.28517592
    floats: 0.233208761
    floats: 0.374441296
    floats: 0.117128536
    floats: 0.212204918
    floats: 0.0338346697
    floats: 0.222554058
    floats: 0.348946184
    floats: 0.0918009654
    floats: 0.291163027
    floats: 0.0686823353
    floats: 0.343872428
    floats: 0.244715095
    floats: 0.349752
    floats: 0.256812871
    floats: 0.275583982
    floats: 0.280820608
    floats: 0.18872267
    floats: -1.18489e-07
    floats: 0.0228897016
    floats: 0.0384190604
    floats: 0.249790385
    floats: 0.205032
    floats: 0.336582959
    floats: 0.193131134
    floats: 0.00739722932
    floats: 0.000431954424
    floats: 0.0189134665
    floats: 0.193269894
    floats: 0.0075977589
    floats: 0.134501219
    floats: 0.4000929
    floats: 0.159506023
    floats: 0.238931537
    floats: 0.299257129
    floats: 0.17056033
    floats: 0.22103925
    floats: 0.154643297
    floats: 0.143126592
    floats: 0.232004508
    floats: 0.142207578
    floats: 0.0356877334
    floats: 0.1844358
    floats: -0.000871229626
    floats: 0.0410134085
    floats: 0.314103752
    floats: 0.345170379
    floats: 0.239927188
    floats: 0.185129479
    floats: 0.385524333
    floats: 0.0962179
    floats: 0.000791567145
    floats: 0.181029737
    floats: 0.205119208
    floats: 0.00657205423
    floats: 0.0133216381
    floats: 0.294735134
    floats: 0.316989183
    floats: 0.251957327
    floats: 0.267023742
    floats: 0.0889304429
    floats: -0.0110771302
    floats: 0.178708166
    floats: 0.301528752
    floats: 0.271811068
    floats: 0.309552461
    floats: 0.324837327
    floats: 0.231557697
    floats: -0.0193355437
    floats: 0.102514684
    floats: 0.184829488
    floats: 0.131462425
    floats: 0.334044904
    floats: 0.248231024
    floats: 0.262071878
    floats: 0.186160102
    floats: 0.285833687
    floats: 0.262097806
    floats: 0.211738795
    floats: 0.0307373274
    floats: 0.221810728
    floats: 0.146497101
    floats: 0.285357237
    floats: 0.170748577
    floats: 0.222246066
    floats: 0.302935809
    floats: 0.280713767
    floats: 0.451431513
    floats: 0.202994749
    floats: 0.260120928
    floats: 0.199927598
    floats: 0.0940322876
    floats: 0.114108853
    floats: 0.0665323809
    floats: 1.42115368e-06
    floats: 0.254936159
    floats: 0.230353281
    floats: 0.287527561
    floats: 0.282798678
    floats: 0.216179118
    floats: 0.0515743084
    floats: 0.253573537
    floats: -1.19504318e-08
  }
}
op {
  output: "res1_match_conv_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 0.0560013689
    floats: 0.100696884
    floats: -0.0235137455
    floats: 0.0587395541
    floats: -1.32275076e-07
    floats: 0.0830200464
    floats: 0.0198597498
    floats: 0.0230977833
    floats: 0.082990773
    floats: 0.0611737035
    floats: 0.11755278
    floats: 0.0994575843
    floats: 0.113971613
    floats: 0.0596830249
    floats: 0.0904716626
    floats: 0.0017649628
    floats: 0.0744022578
    floats: 0.0651545152
    floats: 0.0378173552
    floats: 0.0994734839
    floats: 0.0598035492
    floats: 0.0794208199
    floats: 0.0304572619
    floats: 0.050790675
    floats: 0.13974382
    floats: -0.000132504298
    floats: 0.160610616
    floats: 0.12175189
    floats: -0.000374674681
    floats: -9.44008571e-06
    floats: -0.0262517892
    floats: 0.0759769082
    floats: -0.00258302013
    floats: -0.0272224937
    floats: -0.0412491448
    floats: 0.104687862
    floats: -0.00668477314
    floats: 0.0665942058
    floats: 0.0420294143
    floats: -0.00943420548
    floats: -0.0232917015
    floats: 0.00799116772
    floats: 0.0594276935
    floats: 0.0784125775
    floats: 0.0458305776
    floats: -0.000903923705
    floats: 0.0751607865
    floats: 0.0813529789
    floats: 0.0436565727
    floats: -9.44493513e-05
    floats: -0.0102227367
    floats: -5.85034468e-06
    floats: 0.0595962964
    floats: 0.188330963
    floats: -0.0133619411
    floats: 0.0105665987
    floats: 0.012151245
    floats: 0.0654131398
    floats: 0.20631732
    floats: 0.00999005325
    floats: 0.123997398
    floats: -0.0206897892
    floats: 0.0777761266
    floats: 0.0425542109
    floats: -0.0699564
    floats: 0.170961499
    floats: 0.0473538786
    floats: 0.0357869826
    floats: -8.52248704e-05
    floats: 0.0443207026
    floats: 0.00487929257
    floats: 0.0798833221
    floats: 0.0731379464
    floats: 0.0533359088
    floats: -1.0951328e-06
    floats: 3.58877733e-05
    floats: -0.0374074355
    floats: 0.139257833
    floats: -0.000226878707
    floats: 0.0655031279
    floats: 0.0109453322
    floats: 0.0297422074
    floats: 0.00158140401
    floats: 0.133091539
    floats: -0.0032270581
    floats: 0.0660593882
    floats: -0.0259440951
    floats: 0.00106500788
    floats: 0.00855824444
    floats: 0.102046393
    floats: 0.0265572667
    floats: -8.75589285e-06
    floats: 0.0548693165
    floats: -0.0216637347
    floats: 0.10640388
    floats: 0.00769723
    floats: -0.00014866906
    floats: -0.0679592
    floats: -0.000418436161
    floats: -0.0302051101
    floats: -1.21555913e-05
    floats: 0.228381857
    floats: 0.00804786477
    floats: 0.0480041429
    floats: -1.38041855e-06
    floats: -0.0106990272
    floats: 0.0656909272
    floats: 0.0869301111
    floats: 0.0326727703
    floats: 0.0232400596
    floats: 0.00274596084
    floats: 0.0466397852
    floats: -0.127863169
    floats: -0.00251356885
    floats: 0.0325926021
    floats: 0.0168925487
    floats: 0.130599245
    floats: 0.0439454019
    floats: 0.00248580799
    floats: 0.0838366747
    floats: 0.0976619795
    floats: -0.000171250562
    floats: -4.34154845e-06
    floats: 0.0422211923
    floats: -0.00784037821
    floats: -0.00110039162
    floats: 0.0574625134
    floats: 0.0819854513
    floats: 0.0675701201
    floats: 0.0365750343
    floats: -4.04547109e-06
    floats: 0.00935749337
    floats: 0.0442305841
    floats: 0.0834504291
    floats: 0.0354934596
    floats: 0.00214879098
    floats: -0.00729686441
    floats: 0.0281413235
    floats: -2.36698179e-06
    floats: 0.0173451081
    floats: -0.0300542023
    floats: 0.0221071597
    floats: 0.0244423263
    floats: 0.035949748
    floats: 0.0509271957
    floats: 0.0375088975
    floats: 0.0318358764
    floats: 0.0342788361
    floats: -0.0109090321
    floats: 0.0343715176
    floats: -0.00970362499
    floats: 0.146572918
    floats: 0.0363447852
    floats: 0.0124065448
    floats: -0.111345932
    floats: 0.0501887761
    floats: 0.00570237311
    floats: 0.0754778236
    floats: -0.0211915392
    floats: 0.238027513
    floats: 0.0024655438
    floats: 0.0844159
    floats: 0.0125535214
    floats: 0.0182309914
    floats: -0.0148633076
    floats: 0.123409174
    floats: 0.0159537848
    floats: 0.213962689
    floats: 0.0947534814
    floats: 0.0182152484
    floats: 0.0688557327
    floats: -8.64451692e-07
    floats: -0.018589
    floats: -0.00170709717
    floats: 0.162326172
    floats: 0.0135489497
    floats: -0.0212114137
    floats: 0.0620951392
    floats: 0.0811979771
    floats: -0.00154970994
    floats: 0.0444951802
    floats: 0.104429439
    floats: -0.0144957956
    floats: 0.0887306556
    floats: 0.0457851663
    floats: 0.00506752543
    floats: 0.112939015
    floats: 0.071483
    floats: 0.0799582824
    floats: 0.0950688645
    floats: 0.0924358815
    floats: 0.049169682
    floats: 0.0652239919
    floats: 0.086593084
    floats: 0.00494448235
    floats: -0.0134492368
    floats: -0.00341774849
    floats: 0.0107796928
    floats: 0.0271950308
    floats: 0.0344093852
    floats: 0.0667642877
    floats: 0.0344098434
    floats: 0.0771713257
    floats: 0.0661325157
    floats: -0.000778421236
    floats: 0.0597798042
    floats: 0.000796241453
    floats: -0.00107121456
    floats: -0.032077767
    floats: 0.0357929
    floats: 0.0318929926
    floats: 0.134301022
    floats: 0.102371022
    floats: 0.0369970798
    floats: -0.0947044492
    floats: 0.133948177
    floats: 0.0179496873
    floats: -0.0178407189
    floats: -0.0122923069
    floats: 0.0128832469
    floats: 0.102358766
    floats: -0.0834601596
    floats: 0.0627363846
    floats: -0.0071496875
    floats: 0.0486504622
    floats: 0.129685119
    floats: 0.0880896822
    floats: 0.0909488797
    floats: 0.0573038869
    floats: 0.0883221
    floats: 0.0405201055
    floats: 0.0995726362
    floats: -0.0150663843
    floats: 0.142413974
    floats: -0.0776385739
    floats: 0.0387066416
    floats: 0.0199230686
    floats: 0.128520221
    floats: 0.0690221414
    floats: 0.0288768802
    floats: 0.0856739134
    floats: -0.065775089
    floats: 0.0235387255
    floats: 0.0346456282
    floats: 0.0208390802
    floats: 0.0280735679
    floats: 0.00380458706
    floats: -2.10459e-05
    floats: 0.0834715441
    floats: 0.0232018195
    floats: 0.0892025754
    floats: 0.160229445
    floats: 0.0183390547
    floats: -0.0372705
    floats: 0.00245543593
    floats: -1.22965332e-07
  }
}
op {
  output: "res2_conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 256
    ints: 1
    ints: 1
  }
}
op {
  output: "res2_conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res2_conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res2_conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res2_conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "res2_conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.131946653
    floats: 0.206662774
    floats: 0.160170972
    floats: 0.222438425
    floats: 0.104939915
    floats: 0.14353931
    floats: 0.136447668
    floats: 0.144335598
    floats: 0.207319781
    floats: 0.167480215
    floats: 0.168805853
    floats: 0.211572826
    floats: 0.133744925
    floats: 0.1915925
    floats: 0.118071839
    floats: 0.11432939
    floats: 0.236685932
    floats: 0.110353746
    floats: 0.173100188
    floats: 0.163947597
    floats: 0.122837
    floats: 0.14609988
    floats: 0.202465773
    floats: 0.286911696
    floats: 0.167344496
    floats: 0.0936596841
    floats: 0.10097906
    floats: 0.18418248
    floats: 0.218203261
    floats: 0.116343804
    floats: 0.143795714
    floats: 0.145031914
    floats: 0.171349928
    floats: 0.174985766
    floats: 0.179368868
    floats: 0.148457721
    floats: 0.0879907236
    floats: 0.111311071
    floats: 0.249468103
    floats: 0.217436433
    floats: 0.147875667
    floats: 0.109928161
    floats: 0.141262561
    floats: 0.119763739
    floats: 0.192900211
    floats: 0.159439161
    floats: 0.160862178
    floats: 0.192764506
    floats: 0.210316673
    floats: 0.131848
    floats: 0.110930696
    floats: 0.149928138
    floats: 0.113350458
    floats: 0.143857732
    floats: 0.115339659
    floats: 0.184103385
    floats: 0.218842953
    floats: 0.188927352
    floats: 0.122121677
    floats: 0.187038854
    floats: 0.19179891
    floats: 0.0977847129
    floats: 0.129624426
    floats: 0.147931337
    floats: 0.171398923
    floats: 1.93611811e-08
    floats: 0.146588117
    floats: 0.130165
    floats: 0.143625468
    floats: 4.72231676e-09
    floats: 0.212885082
    floats: 0.135355905
    floats: 0.154887214
    floats: 0.116042934
    floats: 0.102195971
    floats: 0.14961727
    floats: 0.162688166
    floats: 0.129058197
    floats: 0.165866733
    floats: 0.159534231
    floats: 0.169664726
    floats: 0.119288139
    floats: 0.152537599
    floats: 0.171409413
    floats: 0.128616452
    floats: 0.148669109
    floats: 0.147993192
    floats: 0.217116475
    floats: 0.180971369
    floats: 0.155105963
    floats: 0.165985152
    floats: 0.136855885
    floats: 0.154408008
    floats: 0.156811789
    floats: 0.161939949
    floats: 0.133390471
    floats: 0.160369247
    floats: 0.106705733
    floats: 0.147037268
    floats: 0.210412189
    floats: 0.181012288
    floats: 0.125388891
    floats: 0.133428439
    floats: 0.158486113
    floats: 0.123987786
    floats: 0.206784815
    floats: 0.133632123
    floats: 0.141665816
    floats: 0.155963421
    floats: 0.168881208
    floats: 0.139866099
    floats: 0.166312844
    floats: 0.232590303
    floats: 0.147736579
    floats: 0.16005829
    floats: 0.175903827
    floats: 0.147224903
    floats: 0.219042763
    floats: 0.130870119
    floats: 0.124555796
    floats: 0.180814907
    floats: 0.114290476
    floats: 0.144915611
    floats: 0.165953442
    floats: 0.197453603
    floats: 0.149833083
    floats: 0.111092918
    floats: 0.121085256
  }
}
op {
  output: "res2_conv1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
