op {
  output: "conv_conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 96
    ints: 3
    ints: 7
    ints: 7
  }
}
op {
  output: "conv_conv1_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.663897693
    floats: 1.23217773
    floats: 0.981660247
    floats: 0.790777385
    floats: 0.786308706
    floats: 0.65818876
    floats: 0.786256194
    floats: 0.78385675
    floats: 0.831555068
    floats: 0.73493737
    floats: 0.802464604
    floats: 0.612862885
    floats: 0.729987204
    floats: 0.792508
    floats: 0.618165672
    floats: 0.432813495
    floats: 0.98741281
    floats: 0.691935062
    floats: 0.789591968
    floats: 1.12612641
    floats: 0.782852769
    floats: 0.401066393
    floats: 1.34531701
    floats: 0.53975594
    floats: 0.655179322
    floats: 0.530651927
    floats: 0.704156399
    floats: 0.478353798
    floats: 1.15249181
    floats: 0.835636675
    floats: 0.725993574
    floats: 0.840933561
    floats: 0.286315918
    floats: 0.689862907
    floats: 1.27052665
    floats: 0.851328254
    floats: 0.79481
    floats: 0.642792642
    floats: 0.898216784
    floats: 0.871651471
    floats: 0.857133627
    floats: 0.756239116
    floats: 1.3001436
    floats: 0.624661863
    floats: 0.709920943
    floats: 0.470867157
    floats: 0.946154475
    floats: 0.603718817
    floats: 0.939307153
    floats: 0.777500808
    floats: 0.644667804
    floats: 1.03726959
    floats: 0.505706549
    floats: 0.977703035
    floats: 0.618068635
    floats: 0.692790806
    floats: 0.88146174
    floats: 0.837209344
    floats: 0.619908392
    floats: 0.661553264
    floats: 0.987630963
    floats: 0.876496673
    floats: 0.749855697
    floats: 0.717766166
    floats: 0.649940193
    floats: 1.28994393
    floats: 0.637722135
    floats: 1.08692598
    floats: 0.974036872
    floats: 0.818725884
    floats: 0.74708575
    floats: 0.750874758
    floats: 0.718464613
    floats: 0.795882463
    floats: 0.87741816
    floats: 0.65101403
    floats: 0.693858564
    floats: 0.855254769
    floats: 0.690373063
    floats: 0.696097434
    floats: 1.34686065
    floats: 0.83884567
    floats: 0.649222791
    floats: 0.754753351
    floats: 0.942598462
    floats: 0.202506289
    floats: 0.87028712
    floats: 0.732083619
    floats: 0.871472359
    floats: 0.825757325
    floats: 0.650071561
    floats: 0.820716619
    floats: 0.73246038
    floats: 0.88219744
    floats: 0.802617192
    floats: 0.707829773
  }
}
op {
  output: "conv_conv1_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.625169039
    floats: -1.57188332
    floats: 1.37558424
    floats: 0.278551787
    floats: -0.874751449
    floats: 0.439291209
    floats: -0.974410832
    floats: -0.69269073
    floats: 0.80252707
    floats: 0.704632163
    floats: 0.877331376
    floats: 0.517701626
    floats: 0.851889908
    floats: 0.355841607
    floats: -0.278469831
    floats: 0.499316126
    floats: 1.24296844
    floats: 0.66921258
    floats: -0.186659664
    floats: -0.957056046
    floats: 0.916844666
    floats: -0.652934909
    floats: 0.187888473
    floats: -0.30849722
    floats: 0.671368539
    floats: 0.605132
    floats: 0.505458951
    floats: -0.42527771
    floats: -0.883524
    floats: 0.104391307
    floats: 0.610336661
    floats: -1.05846608
    floats: -0.317249089
    floats: 1.06262875
    floats: 0.19953306
    floats: 0.450621247
    floats: 0.640516281
    floats: 0.583180428
    floats: 0.152668178
    floats: -0.22261779
    floats: -0.41449526
    floats: 1.00437009
    floats: -1.20238328
    floats: 0.696738064
    floats: 0.6270715
    floats: 0.406175077
    floats: -0.771141171
    floats: 0.162580356
    floats: 0.113886952
    floats: 1.00257897
    floats: 0.685978651
    floats: -1.01190364
    floats: 0.5272367
    floats: -1.06649089
    floats: 0.319633722
    floats: 0.211457819
    floats: -0.930641472
    floats: 1.25341952
    floats: 1.10534596
    floats: 0.464569032
    floats: 0.196870327
    floats: 0.917647898
    floats: 1.36624026
    floats: 0.0401037373
    floats: 1.11317277
    floats: 0.198505819
    floats: -0.884679735
    floats: -0.610942304
    floats: 1.17691541
    floats: 0.304341048
    floats: 0.991493225
    floats: 0.628664792
    floats: 0.749719679
    floats: 0.210549951
    floats: -0.977384
    floats: 0.142678201
    floats: 0.49889195
    floats: 0.339363128
    floats: 0.302374244
    floats: 0.353330106
    floats: 0.189678237
    floats: -0.752621472
    floats: 0.434449315
    floats: 0.109610789
    floats: -0.620097756
    floats: -0.326298475
    floats: 0.795845866
    floats: 0.755325377
    floats: 0.502278566
    floats: -0.0355688706
    floats: -0.464601398
    floats: 0.517336369
    floats: 0.168848604
    floats: 0.365358979
    floats: -0.408681661
    floats: 0.69567287
  }
}
op {
  output: "conv_conv2red_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 96
    ints: 1
    ints: 1
  }
}
op {
  output: "conv_conv2red_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "conv_conv2red_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "conv_conv2red_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "conv_conv2red_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "conv_conv2red_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "conv_conv2red_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.66164875
    floats: 0.453050494
    floats: 1.55116105
    floats: 0.55465585
    floats: 1.0785805
    floats: 0.327079743
    floats: 1.05583179
    floats: 0.685355425
    floats: 0.459338367
    floats: 0.402432024
    floats: 0.519781113
    floats: 0.920511603
    floats: 0.64338
    floats: 0.350684
    floats: 0.846065164
    floats: 0.809119463
    floats: 1.60951138
    floats: 1.04071259
    floats: 0.57905376
    floats: 1.36912727
    floats: 0.801169455
    floats: 2.49061608
    floats: 0.980953276
    floats: 0.581218481
    floats: 0.467376381
    floats: 1.17850363
    floats: 0.545751333
    floats: 0.427348733
    floats: 1.02058899
    floats: 0.490255296
    floats: 1.10117733
    floats: 0.535418034
    floats: 0.410250068
    floats: 0.467865676
    floats: 1.96131694
    floats: 0.739169717
    floats: 0.518623292
    floats: 1.10862839
    floats: 0.7362023
    floats: 0.776213944
    floats: 0.349879
    floats: 0.382011652
    floats: 0.377066642
    floats: 1.11375105
    floats: 0.631850243
    floats: 0.721427381
    floats: 0.370685697
    floats: 0.729353309
    floats: 1.80009043
    floats: 0.292256057
    floats: 1.44285417
    floats: 0.529761195
    floats: 0.60242337
    floats: 0.434427738
    floats: 0.616043866
    floats: 0.754047275
    floats: 0.482189089
    floats: 1.58692157
    floats: 0.456389278
    floats: 0.403190136
    floats: 1.24085712
    floats: 0.51036495
    floats: 0.48768276
    floats: 0.395335
    floats: 2.04496574
    floats: 0.500891924
    floats: 1.44033158
    floats: 0.721849084
    floats: 0.577583134
    floats: 0.839213669
    floats: 0.429194391
    floats: 0.465772897
    floats: 0.75784111
    floats: 0.533841372
    floats: 0.594472528
    floats: 0.839129508
    floats: 0.561880052
    floats: 1.29626727
    floats: 0.591574311
    floats: 0.873256445
    floats: 0.469639122
    floats: 0.450571179
    floats: 1.26183164
    floats: 1.24075282
    floats: 0.653841913
    floats: 0.405727535
    floats: 0.486283362
    floats: 1.55180657
    floats: 0.973424852
    floats: 1.7641716
    floats: 0.583957613
    floats: 2.51629972
    floats: 0.868872225
    floats: 0.401621222
    floats: 0.390427738
    floats: 0.756761909
    floats: 1.3338
    floats: 0.903803885
    floats: 1.0359906
    floats: 0.968144715
    floats: 0.433388501
    floats: 0.767506
    floats: 0.457871497
    floats: 0.967144966
    floats: 0.379531682
    floats: 0.61481446
    floats: 1.33148217
    floats: 1.10414386
    floats: 0.383739203
    floats: 1.394521
    floats: 0.478105277
    floats: 0.971529365
    floats: 0.404900938
    floats: 0.515807629
    floats: 2.17506027
    floats: 1.88714731
    floats: 0.71320194
    floats: 1.25562024
    floats: 1.73871696
    floats: 1.48106289
    floats: 0.378302038
    floats: 0.523230255
    floats: 0.57365644
    floats: 0.681792557
    floats: 1.14845073
    floats: 0.372445166
    floats: 0.973916948
    floats: 0.46474725
  }
}
op {
  output: "conv_conv2red_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.156509072
    floats: 0.0827138
    floats: -0.60180372
    floats: 0.101265222
    floats: -0.860203803
    floats: 0.126162574
    floats: -0.178541973
    floats: -0.01212346
    floats: 0.0609258041
    floats: 0.200169042
    floats: 0.122230165
    floats: -1.38918281
    floats: 0.146422848
    floats: 0.467894912
    floats: -1.07766569
    floats: 0.116545044
    floats: -0.596174717
    floats: -0.001864449
    floats: -0.0169599261
    floats: -0.508641839
    floats: 0.223848522
    floats: -1.1438514
    floats: -0.0794367865
    floats: 0.557137072
    floats: 0.481522948
    floats: -0.648285747
    floats: -0.124479257
    floats: 0.29928109
    floats: -0.0958634838
    floats: 0.184622541
    floats: -0.3694157
    floats: 0.34940955
    floats: 0.439817458
    floats: 0.0439167507
    floats: -0.877800465
    floats: 0.221689731
    floats: -0.161001772
    floats: 0.238120869
    floats: -0.258763671
    floats: -0.0286296606
    floats: 0.730195224
    floats: 0.448651224
    floats: 0.0939341
    floats: -0.459999382
    floats: 0.329157293
    floats: -0.221649393
    floats: 1.21113658
    floats: 0.0727989078
    floats: -0.786031187
    floats: 1.62287319
    floats: -0.459684849
    floats: 0.5246737
    floats: -0.21793887
    floats: 1.09211493
    floats: 0.495783627
    floats: -0.0401609279
    floats: 0.669271886
    floats: -0.282905757
    floats: 0.052892305
    floats: 0.258585364
    floats: -0.780965924
    floats: 0.741654336
    floats: 0.0446224883
    floats: 0.380848408
    floats: -1.10678434
    floats: 0.355122328
    floats: -0.497477889
    floats: 0.131859407
    floats: 0.612875104
    floats: -0.756714225
    floats: 0.17858839
    floats: -0.0587157458
    floats: 0.47563237
    floats: 0.147193477
    floats: 0.493795842
    floats: 0.216779351
    floats: -0.336602747
    floats: -0.337265253
    floats: 0.0665582046
    floats: 0.0590312332
    floats: 0.222561255
    floats: 0.0128739346
    floats: -0.248236582
    floats: -0.47141856
    floats: -0.379071265
    floats: 0.29682529
    floats: 0.32413733
    floats: -0.572631836
    floats: -0.07563591
    floats: -0.713051736
    floats: 0.0791673958
    floats: -1.27108061
    floats: -0.316558629
    floats: 0.573667288
    floats: 0.60204649
    floats: 0.163044661
    floats: -0.335559487
    floats: 0.0983917937
    floats: 0.235870659
    floats: -0.0187646318
    floats: -0.241573796
    floats: 0.113660224
    floats: 0.219418362
    floats: 0.13186577
    floats: 0.847958207
    floats: 0.42707625
    floats: -0.412792802
    floats: -0.129925027
    floats: 0.306600899
    floats: -0.507214189
    floats: 0.7351439
    floats: 0.0813240111
    floats: 0.418292046
    floats: 0.14258261
    floats: -1.27254891
    floats: -0.873220384
    floats: 0.0408048853
    floats: -0.32681495
    floats: -0.635905266
    floats: -0.865892529
    floats: 0.117324725
    floats: 0.525234282
    floats: 0.354799956
    floats: 0.207820609
    floats: -1.31396222
    floats: 0.245981157
    floats: 0.0133829508
    floats: 0.469407
  }
}
op {
  output: "conv_conv2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 288
    ints: 128
    ints: 3
    ints: 3
  }
}
op {
  output: "conv_conv2_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 288
  }
}
op {
  output: "conv_conv2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 288
  }
}
op {
  output: "conv_conv2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 288
  }
}
op {
  output: "conv_conv2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 288
  }
}
op {
  output: "conv_conv2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 288
  }
}
op {
  output: "conv_conv2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 288
  }
  arg {
    name: "values"
    floats: 0.72009
    floats: 0.7649073
    floats: 0.73923552
    floats: 0.762766242
    floats: 0.495301455
    floats: 0.493628681
    floats: 0.683273792
    floats: 0.532586932
    floats: 0.50249958
    floats: 0.643534839
    floats: 0.532204
    floats: 0.651345313
    floats: 0.510765374
    floats: 0.603222072
    floats: 0.600834906
    floats: 0.529648244
    floats: 0.514477491
    floats: 0.668923
    floats: 0.638847649
    floats: 0.438679218
    floats: 0.850593
    floats: 0.622609794
    floats: 0.526152432
    floats: 0.812245667
    floats: 0.503609121
    floats: 0.605106473
    floats: 0.655064106
    floats: 0.553614497
    floats: 0.63160336
    floats: 0.514826179
    floats: 0.505160093
    floats: 0.668576598
    floats: 0.491007745
    floats: 0.543672562
    floats: 0.454905599
    floats: 0.649839044
    floats: 0.561341047
    floats: 0.473328769
    floats: 0.542737246
    floats: 0.736934662
    floats: 0.707360089
    floats: 0.742511272
    floats: 0.628358126
    floats: 0.43600437
    floats: 0.601899326
    floats: 0.576395392
    floats: 0.547803521
    floats: 0.701994181
    floats: 0.724441171
    floats: 0.565541089
    floats: 0.679147065
    floats: 0.642258108
    floats: 0.79097873
    floats: 0.754190445
    floats: 0.631083965
    floats: 0.626071036
    floats: 0.672268867
    floats: 0.652086914
    floats: 0.72696954
    floats: 0.615407109
    floats: 0.55922544
    floats: 0.846511722
    floats: 0.569015384
    floats: 0.605595827
    floats: 0.607339084
    floats: 0.481001258
    floats: 0.573233485
    floats: 0.490417898
    floats: 0.689666748
    floats: 0.466869414
    floats: 0.635790229
    floats: 0.997128069
    floats: 0.893015563
    floats: 0.649430335
    floats: 0.394144833
    floats: 0.803803504
    floats: 0.488897383
    floats: 0.462227821
    floats: 0.500687361
    floats: 0.502313197
    floats: 0.882701576
    floats: 0.601695836
    floats: 0.472546548
    floats: 0.409365803
    floats: 0.608177125
    floats: 0.509834707
    floats: 0.493007123
    floats: 0.779833496
    floats: 0.588888526
    floats: 0.460575938
    floats: 0.527135611
    floats: 0.571538568
    floats: 0.530356526
    floats: 0.484751314
    floats: 0.836529493
    floats: 0.648062348
    floats: 0.630200446
    floats: 0.460136801
    floats: 0.541437328
    floats: 0.871743321
    floats: 0.637921572
    floats: 0.631037056
    floats: 0.869494557
    floats: 0.628967881
    floats: 0.644205093
    floats: 0.853645265
    floats: 0.716829598
    floats: 0.766045749
    floats: 0.661132634
    floats: 0.549228787
    floats: 0.574513257
    floats: 0.740055859
    floats: 0.448471546
    floats: 0.498530447
    floats: 0.542238951
    floats: 0.641157627
    floats: 0.541935384
    floats: 0.657918334
    floats: 0.559962034
    floats: 0.649430275
    floats: 0.584523737
    floats: 0.448662788
    floats: 0.76515162
    floats: 0.750250876
    floats: 0.638736069
    floats: 0.528576255
    floats: 0.866610587
    floats: 0.906151056
    floats: 0.412255645
    floats: 0.716649473
    floats: 0.579151273
    floats: 0.627898276
    floats: 0.525188208
    floats: 0.633742809
    floats: 0.648957729
    floats: 0.670066297
    floats: 0.67561394
    floats: 0.396346599
    floats: 0.639743805
    floats: 0.659707785
    floats: 0.62898618
    floats: 0.654243827
    floats: 0.612772167
    floats: 0.585582316
    floats: 0.818443477
    floats: 0.588386178
    floats: 0.568334162
    floats: 0.473482341
    floats: 0.600183
    floats: 0.585806489
    floats: 0.748518109
    floats: 0.609975755
    floats: 0.557522476
    floats: 0.61621815
    floats: 0.58328855
    floats: 0.691526055
    floats: 0.599035561
    floats: 0.689703822
    floats: 0.538256347
    floats: 0.700391293
    floats: 0.402687818
    floats: 0.751981914
    floats: 0.62871474
    floats: 0.682668447
    floats: 0.631803334
    floats: 0.666470349
    floats: 0.487464368
    floats: 0.709244072
    floats: 0.704242647
    floats: 0.590633571
    floats: 0.522559047
    floats: 0.585208833
    floats: 0.417992234
    floats: 0.724690378
    floats: 0.707171202
    floats: 0.757604
    floats: 0.582549095
    floats: 0.69973141
    floats: 0.535914719
    floats: 0.689465344
    floats: 0.900402606
    floats: 0.741850197
    floats: 0.476518184
    floats: 0.4621737
    floats: 0.738025
    floats: 0.622240961
    floats: 0.714245
    floats: 0.567114115
    floats: 0.572804868
    floats: 0.56537
    floats: 0.474434167
    floats: 0.721591294
    floats: 0.701853096
    floats: 0.41981557
    floats: 0.483123899
    floats: 0.548399091
    floats: 0.559628
    floats: 0.739693344
    floats: 0.513358593
    floats: 0.533952594
    floats: 0.474318
    floats: 0.570808113
    floats: 0.708870769
    floats: 0.455794692
    floats: 0.639238179
    floats: 0.683484852
    floats: 0.661763072
    floats: 0.698345661
    floats: 0.532674491
    floats: 0.599294841
    floats: 0.463455439
    floats: 0.775564909
    floats: 0.790830791
    floats: 0.544935048
    floats: 0.450565904
    floats: 0.624623716
    floats: 0.623580933
    floats: 0.677837789
    floats: 0.458982319
    floats: 0.680609584
    floats: 0.721591711
    floats: 0.755490184
    floats: 0.635327697
    floats: 0.518761873
    floats: 0.607895255
    floats: 0.497129887
    floats: 0.682296872
    floats: 0.761467636
    floats: 0.609990537
    floats: 0.594270945
    floats: 0.627971232
    floats: 0.793150663
    floats: 0.486025602
    floats: 0.624992847
    floats: 0.755090177
    floats: 0.764117301
    floats: 0.548108757
    floats: 0.766150951
    floats: 0.659738719
    floats: 0.772028387
    floats: 0.675144732
    floats: 0.61819607
    floats: 0.761715949
    floats: 0.667806447
    floats: 0.504456401
    floats: 0.696210504
    floats: 0.714324892
    floats: 0.591314435
    floats: 0.450368553
    floats: 0.544443607
    floats: 0.602943957
    floats: 0.697137296
    floats: 0.837402403
    floats: 1.07195842
    floats: 0.854885161
    floats: 0.574543178
    floats: 0.661012948
    floats: 0.63735956
    floats: 0.471907198
    floats: 0.454936981
    floats: 0.808494806
    floats: 0.79086256
    floats: 0.526440144
    floats: 0.749258518
    floats: 0.61539948
    floats: 0.532402337
    floats: 0.718642592
    floats: 0.580172
    floats: 0.66529
    floats: 0.664282084
    floats: 0.51913166
    floats: 0.661788881
    floats: 0.450463027
    floats: 0.48180151
    floats: 0.510148108
    floats: 0.576619089
    floats: 0.426523149
    floats: 0.597481847
    floats: 0.591984212
    floats: 0.504771471
    floats: 0.689992189
    floats: 0.622616768
    floats: 0.68751204
    floats: 0.777523935
    floats: 0.492156059
    floats: 0.749179721
    floats: 0.577265918
    floats: 0.760300398
  }
}
op {
  output: "conv_conv2_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 288
  }
  arg {
    name: "values"
    floats: -0.166837439
    floats: 0.0895983726
    floats: 0.0588870496
    floats: -0.237752676
    floats: -0.0712971687
    floats: 0.112628631
    floats: -0.306599766
    floats: -0.240930483
    floats: -0.176814809
    floats: -0.458061427
    floats: 0.786980271
    floats: -0.0181262922
    floats: 0.0382569134
    floats: -0.0830896
    floats: -0.107100546
    floats: 0.143386409
    floats: 0.168620765
    floats: -0.321905464
    floats: -0.0986469388
    floats: 0.867245138
    floats: -0.360619754
    floats: -0.0480385534
    floats: 0.048359666
    floats: -0.370597869
    floats: 0.0336400941
    floats: 0.130329341
    floats: 0.0582820475
    floats: -0.297344238
    floats: -0.3029342
    floats: 0.03817451
    floats: 0.52437371
    floats: 0.236473814
    floats: 0.438164026
    floats: -0.195978105
    floats: 0.858807087
    floats: -0.069275327
    floats: -0.123362064
    floats: 0.386401922
    floats: -0.116526358
    floats: -0.128605843
    floats: -0.279228121
    floats: -0.359507412
    floats: 0.00495717116
    floats: 0.853333592
    floats: -0.132097
    floats: -0.477053702
    floats: -0.0960415825
    floats: -0.393064171
    floats: -0.106875084
    floats: -0.339483321
    floats: -0.175306424
    floats: -0.0945733562
    floats: -0.102090567
    floats: -0.369987279
    floats: -0.223944947
    floats: 0.0668781176
    floats: 0.0911786258
    floats: -0.152621984
    floats: -0.252123982
    floats: -0.106490903
    floats: -0.0229545608
    floats: -0.30148676
    floats: -0.314366817
    floats: -0.181862742
    floats: 0.203179717
    floats: 0.0447396487
    floats: 0.0975156054
    floats: 0.687738061
    floats: -0.0889184847
    floats: 0.20259054
    floats: -0.236304507
    floats: -1.35766339
    floats: -0.738300622
    floats: -0.140803322
    floats: -0.0614622757
    floats: -0.512797058
    floats: 0.288348168
    floats: 0.451107532
    floats: -0.0438068397
    floats: -0.0895182
    floats: -0.486060709
    floats: 0.0396933667
    floats: 0.533323944
    floats: 0.145402446
    floats: -0.167668119
    floats: 0.47356683
    floats: -0.158342913
    floats: -0.314705074
    floats: 0.0488700904
    floats: 0.195478335
    floats: -0.0758408085
    floats: -0.157353461
    floats: -0.292685
    floats: 0.491962612
    floats: -0.666242838
    floats: -0.0686063692
    floats: -0.0199289862
    floats: 0.148067355
    floats: 0.154730722
    floats: -0.610779166
    floats: -0.138673544
    floats: -0.14529562
    floats: -0.448027313
    floats: 0.188417092
    floats: -0.221910238
    floats: -0.45606792
    floats: -0.232305169
    floats: 0.202536374
    floats: -0.0526197739
    floats: 0.142354757
    floats: 0.0682259351
    floats: -0.402559161
    floats: 0.264203668
    floats: 0.50416708
    floats: -0.29778558
    floats: -0.303988367
    floats: -0.0203086305
    floats: -0.518400908
    floats: 0.1373353
    floats: 0.211231291
    floats: -0.25202632
    floats: 0.403943151
    floats: -0.35924983
    floats: -0.165571868
    floats: -0.136904955
    floats: -0.187500283
    floats: -0.374763131
    floats: -0.881162286
    floats: 0.550784767
    floats: -0.2218391
    floats: -0.153285265
    floats: -0.404230803
    floats: -0.249841094
    floats: -0.217555463
    floats: -0.420717478
    floats: -0.0997314304
    floats: -0.25205037
    floats: 0.452953
    floats: -0.538615167
    floats: 0.0618519261
    floats: 0.201393619
    floats: -0.470195889
    floats: -0.404420942
    floats: -0.021706542
    floats: -0.273746
    floats: -0.204114437
    floats: -0.22826992
    floats: 0.605743051
    floats: -0.168888584
    floats: -0.0678056106
    floats: -0.287299365
    floats: -0.122976899
    floats: 0.0246543176
    floats: -0.56823951
    floats: -0.264244109
    floats: 0.0147991981
    floats: -0.346804231
    floats: -0.12382596
    floats: -0.0671537146
    floats: -0.203673407
    floats: 0.461091846
    floats: 0.0707573369
    floats: -0.125479966
    floats: -0.649255037
    floats: 0.000447898055
    floats: -0.0104307821
    floats: -0.16802156
    floats: -0.280980974
    floats: -0.0178568382
    floats: -0.160337657
    floats: -0.241822124
    floats: -0.0480174795
    floats: -0.026809277
    floats: -0.0759064555
    floats: -0.259031117
    floats: -0.186256111
    floats: -0.165835902
    floats: -0.207538038
    floats: -0.0469072387
    floats: -0.235950038
    floats: -0.464118421
    floats: -0.300884634
    floats: -0.12923637
    floats: 0.524581194
    floats: -0.1011668
    floats: 0.0896021277
    floats: -0.162715495
    floats: -0.0477225929
    floats: -0.335366577
    floats: 0.679582357
    floats: 0.631196797
    floats: -0.182453379
    floats: 0.164820671
    floats: 0.365810722
    floats: 0.0316392742
    floats: -0.131259307
    floats: -0.0526567698
    floats: -0.0244480036
    floats: -0.302998483
    floats: -0.0822449327
    floats: -0.0619135387
    floats: -0.226544902
    floats: -0.406231672
    floats: 0.946902394
    floats: -0.0817582309
    floats: -0.278545141
    floats: -0.202619538
    floats: 0.590062797
    floats: -0.0878681764
    floats: -0.274965584
    floats: 0.434130937
    floats: -0.0749795735
    floats: -0.348587543
    floats: -0.169822454
    floats: 0.529362917
    floats: 0.0713885725
    floats: -0.100437552
    floats: 0.205287576
    floats: 0.694119751
    floats: 0.0165176652
    floats: -0.199491277
    floats: 0.122989409
    floats: -0.451434433
    floats: -0.051080808
    floats: 0.0945782661
    floats: -0.114984706
    floats: -0.129406497
    floats: -0.369479358
    floats: -0.111964054
    floats: -0.436921328
    floats: -0.297699153
    floats: -0.31219995
    floats: 0.159023136
    floats: -0.0560766347
    floats: -0.383209169
    floats: -0.161673158
    floats: 0.324542373
    floats: 0.156743199
    floats: -0.078229174
    floats: 0.0247902609
    floats: -0.15612261
    floats: -0.213317722
    floats: -0.396953434
    floats: 0.152108401
    floats: -0.0885304
    floats: -0.526291192
    floats: -0.0656177774
    floats: -0.352473944
    floats: 0.273794472
    floats: 0.304933578
    floats: -0.326301366
    floats: -0.31879589
    floats: -0.250452757
    floats: -1.36119688
    floats: -0.607064605
    floats: 0.250434965
    floats: -0.283759892
    floats: -0.310236692
    floats: -0.0355865471
    floats: 0.32453534
    floats: -0.487502366
    floats: -0.170485571
    floats: 0.0280239061
    floats: -0.308399588
    floats: -0.247919515
    floats: -0.0936311558
    floats: 0.0263057034
    floats: -0.0404521786
    floats: -0.127372757
    floats: 0.0287378021
    floats: -0.111382529
    floats: -0.0114820991
    floats: 0.377454787
    floats: -0.241782799
    floats: 0.0548675
    floats: -0.318859786
    floats: 0.602979481
    floats: -0.182361439
    floats: -0.0524719357
    floats: -0.0353234261
    floats: -0.451531738
    floats: -0.236493334
    floats: -0.289640546
    floats: -0.354256183
    floats: -0.263283938
    floats: 0.065228045
    floats: -0.112850964
    floats: -0.245059937
  }
}
op {
  output: "conv_3a_1x1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 96
    ints: 288
    ints: 1
    ints: 1
  }
}
op {
  output: "conv_3a_1x1_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_1x1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_1x1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_1x1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_1x1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_1x1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.418355256
    floats: 0.433508962
    floats: 0.39719364
    floats: 0.378185779
    floats: 0.424910635
    floats: 0.666324615
    floats: 0.414926201
    floats: 0.535105407
    floats: 0.436030954
    floats: 0.613810301
    floats: 0.554456174
    floats: 0.521704495
    floats: 0.575858533
    floats: 0.557890356
    floats: 0.435029507
    floats: 0.628521502
    floats: 0.415639222
    floats: 0.42568019
    floats: 0.563737273
    floats: 0.675737679
    floats: 0.425688237
    floats: 0.355164617
    floats: 0.555519164
    floats: 0.518040776
    floats: 0.459218681
    floats: 0.522020042
    floats: 0.390495211
    floats: 0.417295665
    floats: 0.517367482
    floats: 0.600373685
    floats: 0.549541771
    floats: 0.465350658
    floats: 0.423245251
    floats: 0.558520317
    floats: 0.447709709
    floats: 0.456494391
    floats: 0.589127362
    floats: 0.437389284
    floats: 0.710616767
    floats: 0.437041283
    floats: 0.494830936
    floats: 0.437470973
    floats: 0.611223817
    floats: 0.400470555
    floats: 0.664932609
    floats: 0.645238459
    floats: 0.474372983
    floats: 0.560687959
    floats: 0.402726501
    floats: 0.471218914
    floats: 0.440240055
    floats: 0.418293148
    floats: 0.452904344
    floats: 0.470742911
    floats: 0.369225353
    floats: 0.8644858
    floats: 0.428212851
    floats: 0.590463221
    floats: 0.598598063
    floats: 0.831536233
    floats: 0.598680377
    floats: 0.766031802
    floats: 0.381434023
    floats: 0.751811087
    floats: 0.496252984
    floats: 0.646120667
    floats: 0.739681125
    floats: 0.354803592
    floats: 0.551701903
    floats: 0.398917347
    floats: 0.560421288
    floats: 0.481900334
    floats: 0.423579276
    floats: 0.56058985
    floats: 0.605505586
    floats: 0.455102175
    floats: 0.418709904
    floats: 0.620595098
    floats: 0.539347291
    floats: 0.46110177
    floats: 0.709751606
    floats: 0.380823433
    floats: 0.457344323
    floats: 0.401590705
    floats: 0.693416
    floats: 0.559051
    floats: 0.463570237
    floats: 0.400269598
    floats: 0.555371165
    floats: 0.573280692
    floats: 0.580719054
    floats: 0.423918933
    floats: 0.4129439
    floats: 0.476472676
    floats: 0.426483721
    floats: 0.415576637
  }
}
op {
  output: "conv_3a_1x1_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.0397498719
    floats: 0.279478371
    floats: 0.316567
    floats: 0.600508094
    floats: 0.308574528
    floats: -0.0399054028
    floats: 0.226212054
    floats: 0.0618628114
    floats: 0.753274679
    floats: 0.117742054
    floats: 0.309513718
    floats: 0.359576881
    floats: 0.114727736
    floats: -0.0974895135
    floats: 0.324911296
    floats: 0.368869364
    floats: 0.185894698
    floats: 0.398005188
    floats: 0.092874907
    floats: 0.176549584
    floats: 0.394572109
    floats: 0.280431688
    floats: 0.226031378
    floats: 0.206836864
    floats: 0.22245048
    floats: 0.379819304
    floats: 0.184505686
    floats: 0.504936755
    floats: 0.223392755
    floats: -0.257326901
    floats: 0.397391975
    floats: 0.809794128
    floats: 0.311380565
    floats: 0.181680754
    floats: 0.342355
    floats: 0.491361648
    floats: 0.382380694
    floats: 0.305024326
    floats: 0.0290033203
    floats: 0.485711783
    floats: 0.0745811537
    floats: 0.1490435
    floats: 0.491250217
    floats: 0.496507853
    floats: 0.224206686
    floats: -0.0205142908
    floats: 0.610397518
    floats: 0.328881025
    floats: 0.280742645
    floats: 0.363818228
    floats: 0.388351083
    floats: 0.394311905
    floats: 0.0891381949
    floats: 0.378265351
    floats: 0.321647376
    floats: -0.566643178
    floats: 0.392029494
    floats: 0.351704538
    floats: 0.489037454
    floats: 0.000971161819
    floats: 0.188911244
    floats: 0.16950345
    floats: 0.477993369
    floats: -0.416852415
    floats: 0.184173018
    floats: 0.0719477609
    floats: -0.177372798
    floats: 0.381416
    floats: 0.474996299
    floats: 0.224980175
    floats: 0.0514471047
    floats: 0.0793719515
    floats: 0.698079646
    floats: 0.147807673
    floats: -0.0225241072
    floats: 0.173323214
    floats: 0.332910478
    floats: -0.0053303265
    floats: 0.649445176
    floats: 0.164949208
    floats: 0.541803539
    floats: 0.218100414
    floats: 0.941883206
    floats: 0.364811897
    floats: -0.0207102522
    floats: 0.363896787
    floats: 0.138963789
    floats: 0.784590244
    floats: 0.0756404549
    floats: -0.10316775
    floats: 0.198960647
    floats: 0.201731116
    floats: 0.337310463
    floats: 0.833484411
    floats: 0.479159147
    floats: 0.141927361
  }
}
op {
  output: "conv_3a_3x3_reduce_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 96
    ints: 288
    ints: 1
    ints: 1
  }
}
op {
  output: "conv_3a_3x3_reduce_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_reduce_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_reduce_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_reduce_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_reduce_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_reduce_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.55670774
    floats: 0.58882004
    floats: 0.398046613
    floats: 0.516873479
    floats: 0.403305858
    floats: 0.427709222
    floats: 0.615911484
    floats: 0.560055077
    floats: 0.541518569
    floats: 0.54263252
    floats: 0.418821663
    floats: 0.552042246
    floats: 0.468384475
    floats: 0.547107637
    floats: 0.561674893
    floats: 0.381168
    floats: 0.573779643
    floats: 0.599033237
    floats: 0.71182245
    floats: 0.530800164
    floats: 0.532716036
    floats: 0.438099384
    floats: 0.549029052
    floats: 0.673089147
    floats: 0.760468125
    floats: 0.480930418
    floats: 0.412864774
    floats: 0.317104101
    floats: 0.672659874
    floats: 0.523178041
    floats: 0.517587841
    floats: 0.482331485
    floats: 0.591046751
    floats: 0.477498442
    floats: 0.418645144
    floats: 0.655069828
    floats: 0.439288378
    floats: 0.45728147
    floats: 0.529901862
    floats: 0.714995623
    floats: 0.551286221
    floats: 0.585646689
    floats: 0.459119976
    floats: 0.498131186
    floats: 0.46843788
    floats: 0.593417048
    floats: 0.709186077
    floats: 0.773692429
    floats: 0.514960706
    floats: 0.632566333
    floats: 0.787567377
    floats: 0.486593276
    floats: 0.519803345
    floats: 0.586473346
    floats: 0.688883841
    floats: 0.535099566
    floats: 0.65066874
    floats: 0.689300835
    floats: 0.539943695
    floats: 0.60962373
    floats: 0.580549896
    floats: 0.549784064
    floats: 0.502423465
    floats: 0.781602621
    floats: 0.720877349
    floats: 0.392642915
    floats: 0.598433137
    floats: 0.594658375
    floats: 0.565506697
    floats: 0.599182665
    floats: 0.510785103
    floats: 0.598493814
    floats: 0.523629308
    floats: 0.67803973
    floats: 0.634284914
    floats: 0.510494173
    floats: 0.558499753
    floats: 0.485937864
    floats: 0.703114569
    floats: 0.465003073
    floats: 0.599149823
    floats: 0.550437152
    floats: 0.443384856
    floats: 0.435370624
    floats: 0.399029642
    floats: 0.411560804
    floats: 0.64532423
    floats: 0.53505522
    floats: 0.414486974
    floats: 0.577813
    floats: 0.731793344
    floats: 0.707932472
    floats: 0.543540418
    floats: 0.670462966
    floats: 0.48838678
    floats: 0.47118625
  }
}
op {
  output: "conv_3a_3x3_reduce_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.000339264137
    floats: -0.0711635351
    floats: 0.251468033
    floats: 0.00907411892
    floats: 0.358088762
    floats: 0.0172947738
    floats: -0.0169283152
    floats: 0.0292756222
    floats: -0.182299599
    floats: -0.0638889447
    floats: 0.189716086
    floats: 0.29410544
    floats: 0.117645063
    floats: -0.0829249248
    floats: -0.11525096
    floats: 0.10754735
    floats: -0.0532933809
    floats: -0.214709222
    floats: -0.225860611
    floats: 0.0561388396
    floats: 0.130762547
    floats: 0.28735134
    floats: -0.0768025741
    floats: -0.0849024281
    floats: -0.407948405
    floats: 0.272965074
    floats: 0.0301968101
    floats: 0.520896673
    floats: -0.176227123
    floats: -0.184142381
    floats: -0.204194933
    floats: 0.102280341
    floats: 0.269918054
    floats: 0.283118874
    floats: 0.0399089977
    floats: -0.107918993
    floats: 0.115393065
    floats: 0.0163944606
    floats: 0.0618676
    floats: -0.132451341
    floats: 0.154905349
    floats: 0.0413479954
    floats: -0.0602815412
    floats: 0.229037851
    floats: 0.0142614776
    floats: -0.0866037607
    floats: -0.099973917
    floats: -0.00792350061
    floats: 0.096337162
    floats: 0.217371047
    floats: -0.379879534
    floats: -0.0609015152
    floats: 0.317881942
    floats: 0.00894722715
    floats: -0.331032485
    floats: 0.0861549452
    floats: -0.0519947447
    floats: -0.0443036966
    floats: 0.235588044
    floats: -0.12586917
    floats: 0.103864275
    floats: -0.260831624
    floats: -0.128811017
    floats: -0.395499766
    floats: -0.276238
    floats: 0.212310225
    floats: 0.194870189
    floats: 0.0484295934
    floats: 0.133788586
    floats: 0.0338079035
    floats: 0.122796111
    floats: -0.108644508
    floats: 0.190325499
    floats: -0.174461842
    floats: -0.136047617
    floats: 0.110652566
    floats: 0.167092726
    floats: -0.0356690548
    floats: -0.0250437316
    floats: 0.195402294
    floats: -0.271709561
    floats: -0.0796656236
    floats: 0.270564198
    floats: 0.278136522
    floats: 0.293086082
    floats: 0.251806378
    floats: -0.153581053
    floats: 0.0385120809
    floats: -0.0138860764
    floats: -0.202226803
    floats: -0.260728478
    floats: -0.435760677
    floats: 0.0321759507
    floats: -0.0605275296
    floats: -0.0508444309
    floats: 0.00671763904
  }
}
op {
  output: "conv_3a_3x3_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 96
    ints: 96
    ints: 3
    ints: 3
  }
}
op {
  output: "conv_3a_3x3_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_3x3_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.630780637
    floats: 0.440325499
    floats: 0.790518701
    floats: 0.485244215
    floats: 0.540197074
    floats: 0.482558727
    floats: 0.471939325
    floats: 0.609315872
    floats: 0.480818599
    floats: 0.801659822
    floats: 0.561000586
    floats: 0.408910781
    floats: 0.510014832
    floats: 0.648548186
    floats: 0.751018226
    floats: 0.55636096
    floats: 0.593077898
    floats: 0.504339695
    floats: 0.641147077
    floats: 0.676897049
    floats: 0.862214684
    floats: 0.727170944
    floats: 0.67629081
    floats: 0.39339897
    floats: 0.599758685
    floats: 0.456049532
    floats: 0.509972751
    floats: 0.577781081
    floats: 0.529896557
    floats: 0.400160253
    floats: 0.619835377
    floats: 0.85168165
    floats: 0.680806
    floats: 0.814913273
    floats: 0.515853524
    floats: 0.537155747
    floats: 0.667334199
    floats: 0.849568069
    floats: 0.442832559
    floats: 0.457133502
    floats: 0.707263291
    floats: 0.654873371
    floats: 0.466718435
    floats: 0.435332209
    floats: 0.476632297
    floats: 0.527294636
    floats: 0.479190171
    floats: 0.476032168
    floats: 0.72481662
    floats: 0.495921195
    floats: 0.454579324
    floats: 0.47270444
    floats: 0.449540347
    floats: 0.70116514
    floats: 0.458319575
    floats: 0.516995072
    floats: 0.616702259
    floats: 0.573446691
    floats: 0.571292162
    floats: 0.647259533
    floats: 0.65359807
    floats: 0.665731609
    floats: 0.506050766
    floats: 0.429595709
    floats: 0.463977963
    floats: 0.474440098
    floats: 0.40583539
    floats: 0.752351582
    floats: 0.703923
    floats: 0.788115799
    floats: 0.438174754
    floats: 0.515804708
    floats: 0.603310406
    floats: 0.597116
    floats: 0.605253935
    floats: 0.649790764
    floats: 0.89561379
    floats: 0.77956593
    floats: 0.454833865
    floats: 0.460948557
    floats: 0.433432102
    floats: 0.579469085
    floats: 0.783128
    floats: 0.798407435
    floats: 0.596206605
    floats: 0.537050068
    floats: 0.454133481
    floats: 0.436531693
    floats: 0.573958397
    floats: 0.591227353
    floats: 0.579100966
    floats: 0.660235286
    floats: 0.579393268
    floats: 0.532019079
    floats: 0.442196339
    floats: 0.622819066
  }
}
op {
  output: "conv_3a_3x3_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.00758464215
    floats: -0.047551427
    floats: -0.056819465
    floats: 0.0472148582
    floats: -0.074899219
    floats: -0.05486371
    floats: 0.0653514564
    floats: -0.17489396
    floats: -0.064079538
    floats: -0.124215767
    floats: 0.0409762114
    floats: 0.351979524
    floats: -0.0743100569
    floats: -0.163808987
    floats: -0.0874799564
    floats: 0.048561886
    floats: -0.269778043
    floats: 0.34477362
    floats: -0.105041288
    floats: -0.0523147509
    floats: -0.26283735
    floats: -0.0168082323
    floats: 0.163364843
    floats: 0.160528556
    floats: -0.266210496
    floats: 0.0850531682
    floats: -0.142826959
    floats: -0.276149362
    floats: 0.00258418219
    floats: 0.290480524
    floats: -0.10458532
    floats: -0.329831094
    floats: 0.123222657
    floats: -0.118082121
    floats: -0.0162076633
    floats: 0.242871955
    floats: -0.0935309082
    floats: -0.836333
    floats: 0.268986315
    floats: 0.12574701
    floats: -0.242870778
    floats: -0.00131812529
    floats: 0.130031437
    floats: 0.0620840341
    floats: 0.388420731
    floats: -0.013841548
    floats: -0.0399801396
    floats: 0.161595151
    floats: -0.160336062
    floats: 0.321576864
    floats: -0.0983486399
    floats: 0.144732624
    floats: 0.0616778098
    floats: -0.123435602
    floats: -0.0259448737
    floats: -0.029119622
    floats: -0.175383553
    floats: 0.435403287
    floats: 0.00708976248
    floats: -0.20196864
    floats: 0.16404137
    floats: 0.0319996849
    floats: 0.0997403041
    floats: 0.122033402
    floats: 0.094104819
    floats: -0.0705660507
    floats: 0.711948156
    floats: -0.150345534
    floats: -0.14563337
    floats: -0.141283751
    floats: 0.151627958
    floats: 0.259834826
    floats: -0.0539105907
    floats: -0.0676562414
    floats: 0.126452819
    floats: 0.0785966
    floats: -0.153227612
    floats: -0.149982408
    floats: 0.156066447
    floats: 0.406448811
    floats: 0.151306883
    floats: 0.0334245
    floats: -0.180642322
    floats: -0.0773278624
    floats: 0.0207066648
    floats: -0.0964059532
    floats: 0.252962589
    floats: 0.0739732832
    floats: -8.02881041e-05
    floats: 0.0844494849
    floats: -0.094423905
    floats: -0.105966404
    floats: 0.117547445
    floats: -0.100887842
    floats: 0.402096063
    floats: -0.18567732
  }
}
op {
  output: "conv_3a_double_3x3_reduce_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 96
    ints: 288
    ints: 1
    ints: 1
  }
}
op {
  output: "conv_3a_double_3x3_reduce_b"
  type: "ConstantFill"
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_double_3x3_reduce_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_double_3x3_reduce_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_double_3x3_reduce_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_double_3x3_reduce_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 96
  }
}
op {
  output: "conv_3a_double_3x3_reduce_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.441573471
    floats: 1.07736206
    floats: 0.94131434
    floats: 0.421488374
    floats: 0.602621257
    floats: 0.646376967
    floats: 0.717103839
    floats: 0.42250815
    floats: 0.519043565
    floats: 0.603839815
    floats: 0.376025081
    floats: 0.607097268
    floats: 0.45593366
    floats: 0.455734074
    floats: 0.432274908
    floats: 0.470286101
    floats: 0.5977965
    floats: 0.566003859
    floats: 0.591787755
    floats: 0.706275582
    floats: 0.482125729
    floats: 0.654713571
    floats: 0.666175485
    floats: 0.426140487
    floats: 0.662558794
    floats: 0.721523046
    floats: 0.530551672
    floats: 0.396532476
    floats: 0.496475548
    floats: 0.404332042
    floats: 0.875407
    floats: 0.48508355
    floats: 0.387177
    floats: 0.645751894
    floats: 0.600608766
    floats: 0.643752098
    floats: 0.616756618
    floats: 0.462829858
    floats: 0.63456291
    floats: 0.409321427
    floats: 0.418337882
    floats: 0.434033364
    floats: 0.72547543
    floats: 0.420794636
    floats: 0.594613969
    floats: 0.417028904
    floats: 0.648737788
    floats: 0.629625916
    floats: 0.618669033
    floats: 0.513600528
    floats: 0.496319383
    floats: 0.819847345
    floats: 0.516781211
    floats: 0.424151778
    floats: 0.556392193
    floats: 0.634901822
    floats: 0.728081405
    floats: 0.41140303
    floats: 0.412645936
    floats: 0.668139338
    floats: 0.515545487
    floats: 0.477378756
    floats: 0.540645659
    floats: 0.43647173
    floats: 0.396995693
    floats: 0.634433568
    floats: 0.458764553
    floats: 0.56985563
    floats: 0.498072922
    floats: 0.392223418
    floats: 0.717750669
    floats: 0.701435804
    floats: 0.466743797
    floats: 0.465944618
    floats: 0.484685332
    floats: 0.617385805
    floats: 0.587438583
    floats: 0.97995
    floats: 0.861202776
    floats: 0.533648
    floats: 0.593941748
    floats: 0.439319521
    floats: 0.442775398
    floats: 0.457285285
    floats: 0.7252298
    floats: 0.69588393
    floats: 0.483636826
    floats: 0.575533211
    floats: 0.458960295
    floats: 0.419289857
    floats: 0.705519199
    floats: 0.490221649
    floats: 0.602346659
    floats: 0.491000712
    floats: 0.465375841
    floats: 0.628767729
  }
}
op {
  output: "conv_3a_double_3x3_reduce_b_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 96
  }
  arg {
    name: "values"
    floats: 0.177114248
    floats: -0.838052213
    floats: -0.423589408
    floats: 0.306781918
    floats: 0.204398319
    floats: -0.118213691
    floats: -0.15027152
    floats: 0.0551169813
    floats: -0.0769756
    floats: 0.0088984184
    floats: 0.172757462
    floats: 0.145536527
    floats: 0.186408654
    floats: 0.108792156
    floats: 0.604865432
    floats: 0.235217497
    floats: -0.161388382
    floats: -0.232292667
    floats: -0.322640181
    floats: -0.154863521
    floats: 0.117965102
    floats: 0.0162422266
    floats: -0.0507417172
    floats: 0.220885873
    floats: -0.290156364
    floats: -0.100492157
    floats: 0.122196414
    floats: 0.433630347
    floats: -0.0696167275
    floats: 0.252439499
    floats: -0.488670588
    floats: 0.170087904
    floats: 0.885013461
    floats: 0.0187080242
    floats: -0.437917918
    floats: -0.232766986
    floats: -0.25440523
    floats: 0.0979122296
    floats: 0.174652338
    floats: 1.05814099
    floats: 0.333048314
    floats: 0.512789547
    floats: 0.020972101
    floats: 0.362065583
    floats: 0.107580356
    floats: 0.173955455
    floats: -0.0444465056
    floats: 0.0344260558
    floats: -0.207495332
    floats: 0.154639408
    floats: 0.0860773847
    floats: -0.314457387
