op {
  output: "conv1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 32
    ints: 3
    ints: 3
    ints: 3
  }
}
op {
  output: "conv1_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 32
  }
}
op {
  output: "conv1_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 32
  }
}
op {
  output: "conv1_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 32
  }
}
op {
  output: "conv1_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 32
  }
}
op {
  output: "conv1_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 32
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "conv1_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 32
  }
  arg {
    name: "values"
    floats: 0.407586962
    floats: -0.985148132
    floats: -0.865205705
    floats: -0.636497319
    floats: 0.931340933
    floats: 0.143244386
    floats: -0.661792815
    floats: -1.51345146
    floats: -0.972608566
    floats: 0.859076738
    floats: 2.79930234
    floats: 3.5226903
    floats: 2.10629082
    floats: 1.33473647
    floats: -1.21424472
    floats: -1.23759425
    floats: -1.63252246
    floats: 2.84020543
    floats: 0.170678332
    floats: 0.755880952
    floats: -1.54264283
    floats: -1.03201449
    floats: -1.07113349
    floats: 3.34834623
    floats: -0.530355811
    floats: -1.44746411
    floats: -1.16963887
    floats: -1.44426501
    floats: -1.61292255
    floats: 2.8850162
    floats: 2.06397438
    floats: 0.475046456
  }
}
op {
  output: "conv2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 32
    ints: 3
    ints: 3
  }
}
op {
  output: "conv2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 64
  }
}
op {
  output: "conv2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "conv2_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 64
  }
  arg {
    name: "values"
    floats: 1.02501655
    floats: -0.12960057
    floats: 0.142564714
    floats: -0.27567181
    floats: -0.199757144
    floats: 0.0177486725
    floats: 0.730893314
    floats: 0.12745215
    floats: -1.6446203
    floats: 0.181503192
    floats: 0.105904363
    floats: 0.0922831222
    floats: 0.221073315
    floats: 0.324689388
    floats: 1.70133102
    floats: 0.000457326678
    floats: -0.0509546027
    floats: 0.423189372
    floats: 7.1103406
    floats: 2.22172308
    floats: 2.12837672
    floats: 0.0610172078
    floats: -0.366390556
    floats: -0.853206456
    floats: -0.775102079
    floats: 0.311801195
    floats: 1.52496517
    floats: -2.2341156
    floats: -0.529502332
    floats: 1.51518989
    floats: 0.638463557
    floats: -2.12757874
    floats: 1.26488948
    floats: 2.18932152
    floats: -1.84421134
    floats: -1.62967288
    floats: 2.01567149
    floats: 0.145450979
    floats: 2.11188579
    floats: 0.668150663
    floats: 0.588038146
    floats: 0.105498925
    floats: -1.46761036
    floats: -0.555007219
    floats: -0.384303302
    floats: -0.203040928
    floats: 0.323828399
    floats: -0.322847635
    floats: -1.01928878
    floats: 1.72932124
    floats: 1.77079284
    floats: 0.614907801
    floats: -1.56757355
    floats: 2.24159336
    floats: -1.97178531
    floats: -1.42489684
    floats: -1.64092326
    floats: 0.867824614
    floats: 1.85728633
    floats: 0.843130708
    floats: 1.42433763
    floats: 0.807423353
    floats: -0.000855507562
    floats: 0.0264977142
  }
}
op {
  output: "xception1_match_conv_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 64
    ints: 1
    ints: 1
  }
}
op {
  output: "xception1_match_conv_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_match_conv_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_match_conv_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_match_conv_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_match_conv_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "xception1_match_conv_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.61241
    floats: 0.523665667
    floats: 0.483300626
    floats: 0.431379735
    floats: 0.427983344
    floats: 0.279471099
    floats: 0.281603187
    floats: 0.421196431
    floats: -0.0236689802
    floats: 0.0495274067
    floats: -0.256469965
    floats: 0.749152541
    floats: 0.0554935895
    floats: 1.08472049
    floats: 0.250982404
    floats: 0.200308919
    floats: 0.406939059
    floats: 0.0889841765
    floats: 0.476644069
    floats: 0.0746129602
    floats: 0.41165638
    floats: 0.595661402
    floats: 0.00256073708
    floats: 0.527644038
    floats: 0.420606017
    floats: 0.259995133
    floats: 0.11479494
    floats: 0.578017652
    floats: 0.65361172
    floats: 0.276228368
    floats: 0.369534045
    floats: 0.03460465
    floats: 0.203211874
    floats: 0.168308258
    floats: 1.09869277
    floats: 0.55084455
    floats: 0.373523951
    floats: 0.536636889
    floats: 0.592716932
    floats: 0.48324582
    floats: 0.249713406
    floats: 0.683271945
    floats: -0.332874954
    floats: -0.0172353964
    floats: 0.768623292
    floats: 4.3051095
    floats: 0.115801334
    floats: -0.0383179337
    floats: 0.287086
    floats: 0.347041458
    floats: 0.525224507
    floats: -0.324768752
    floats: 0.700557649
    floats: 0.0906764492
    floats: 0.19937034
    floats: -0.088381812
    floats: 0.230752677
    floats: 0.809156418
    floats: 0.46244064
    floats: 0.461438745
    floats: 0.564080238
    floats: 0.698126435
    floats: 0.30279696
    floats: 0.440739572
    floats: 0.190357566
    floats: 0.467517585
    floats: 0.323489517
    floats: -0.0323820598
    floats: 0.395719796
    floats: 0.58072859
    floats: 0.0517553054
    floats: 0.320817411
    floats: -0.102070615
    floats: 0.206381336
    floats: 0.420377612
    floats: 0.307535112
    floats: 0.561328948
    floats: 0.0879739
    floats: 0.286942393
    floats: 0.0720852
    floats: 0.285744
    floats: 0.236423269
    floats: 0.419057846
    floats: 0.961666524
    floats: 0.257687122
    floats: -0.0175978243
    floats: 0.74454
    floats: 0.528837204
    floats: 0.180929676
    floats: 0.272269815
    floats: 0.22703509
    floats: 0.359243929
    floats: 0.0340426378
    floats: 0.0209557191
    floats: -0.0202504434
    floats: -0.00272949738
    floats: 0.246954709
    floats: -0.0182097312
    floats: 0.0517555587
    floats: 0.361368448
    floats: 0.270947903
    floats: 0.337056875
    floats: 0.493940681
    floats: 0.692651689
    floats: 0.854436874
    floats: -0.438624501
    floats: 0.296684235
    floats: 0.31897822
    floats: 0.729970574
    floats: 0.0702092275
    floats: 0.0760082
    floats: 0.652998388
    floats: 0.181589752
    floats: 0.327758431
    floats: 0.0924466327
    floats: 0.0397005267
    floats: 0.690976143
    floats: 0.311769396
    floats: -0.0593602285
    floats: 0.501956
    floats: 0.344091862
    floats: 0.0870892853
    floats: 0.433322132
    floats: 0.245570511
    floats: 0.231961071
    floats: -0.399499804
    floats: 0.221336469
    floats: 0.590385258
  }
}
op {
  output: "xception1_conv1_1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 64
    ints: 1
    ints: 3
    ints: 3
  }
}
op {
  output: "xception1_conv1_2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 64
    ints: 1
    ints: 1
  }
}
op {
  output: "xception1_conv1_2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv1_2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv1_2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv1_2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv1_2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "xception1_conv1_2_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.69554466
    floats: -0.129746377
    floats: 0.231537983
    floats: 0.134097666
    floats: 0.478446126
    floats: -0.00338639179
    floats: 0.331434101
    floats: -0.671496391
    floats: 0.0403281
    floats: 0.0188297927
    floats: -0.0535738319
    floats: 0.0409114
    floats: -0.129822358
    floats: 0.192732662
    floats: 0.258143395
    floats: 0.108213894
    floats: 0.0700675622
    floats: -0.85291791
    floats: 0.406460762
    floats: -0.438860565
    floats: -0.0723705292
    floats: 0.216434836
    floats: -0.141193748
    floats: 0.351313055
    floats: 0.0166623835
    floats: 0.341072947
    floats: 0.651141167
    floats: -0.212273777
    floats: -0.180511966
    floats: 0.17741634
    floats: -0.0802783221
    floats: 0.336753
    floats: 0.530992568
    floats: -0.0672534
    floats: 0.292517066
    floats: -0.294976532
    floats: -0.0177218318
    floats: 0.441585839
    floats: -0.088743791
    floats: 0.332241833
    floats: 2.16982484
    floats: -0.0409716703
    floats: -0.391569257
    floats: 0.0164705273
    floats: -0.482132375
    floats: -0.157494
    floats: -0.383902699
    floats: 0.0169795025
    floats: -0.116973288
    floats: 0.475040227
    floats: -0.189221159
    floats: 0.0613092594
    floats: 0.122758418
    floats: -0.0407056399
    floats: 1.1148665
    floats: 0.104265027
    floats: 0.204380766
    floats: -0.0148132704
    floats: 0.704331815
    floats: -0.162931561
    floats: -0.269011289
    floats: -1.54124284
    floats: 0.145913109
    floats: -0.173193097
    floats: -0.0215698946
    floats: -0.334447801
    floats: 0.594808817
    floats: 2.21824574
    floats: 0.0366673917
    floats: -0.181285784
    floats: 0.602258384
    floats: -0.433358133
    floats: 0.512293756
    floats: 0.30645135
    floats: 0.135667548
    floats: 0.224214718
    floats: 0.235415623
    floats: -0.0563907437
    floats: -0.0831539333
    floats: 0.228578836
    floats: -0.0547348298
    floats: -0.154170543
    floats: -0.519173622
    floats: 0.224029854
    floats: 0.271732152
    floats: 1.37047946
    floats: -0.0979564041
    floats: -0.279288471
    floats: -0.160683826
    floats: 0.608924747
    floats: 0.280398518
    floats: 0.212024659
    floats: 0.333922148
    floats: 0.00807021558
    floats: 0.693418443
    floats: 0.940356612
    floats: 0.320297897
    floats: 0.237505153
    floats: 0.0848241076
    floats: -0.149198458
    floats: -0.219008639
    floats: 2.47257853
    floats: 0.0343149938
    floats: -0.153410956
    floats: 0.569092
    floats: 0.200842157
    floats: 0.1364467
    floats: -0.0689811
    floats: -0.257605076
    floats: 0.116315208
    floats: 0.305779159
    floats: -1.49346745
    floats: 0.590010047
    floats: -0.414474159
    floats: 0.140519604
    floats: 1.35846508
    floats: -0.169391513
    floats: -0.00152576109
    floats: 0.611095965
    floats: 0.719444
    floats: -0.176534235
    floats: 0.15852046
    floats: -0.251255661
    floats: -0.513974
    floats: 0.340481639
    floats: 0.0228854232
    floats: 0.327505499
    floats: 0.279402584
  }
}
op {
  output: "xception1_conv2_1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 1
    ints: 3
    ints: 3
  }
}
op {
  output: "xception1_conv2_2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 128
    ints: 1
    ints: 1
  }
}
op {
  output: "xception1_conv2_2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv2_2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv2_2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv2_2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 128
  }
}
op {
  output: "xception1_conv2_2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "xception1_conv2_2_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 128
  }
  arg {
    name: "values"
    floats: 0.612190664
    floats: 0.532518744
    floats: 0.486053884
    floats: 0.425392777
    floats: 0.432039946
    floats: 0.27926296
    floats: 0.281538099
    floats: 0.419077218
    floats: -0.0213583075
    floats: 0.0468503535
    floats: -0.258450359
    floats: 0.748088837
    floats: 0.0534079708
    floats: 1.08727777
    floats: 0.255721092
    floats: 0.189672962
    floats: 0.400907964
    floats: 0.0941745788
    floats: 0.475374162
    floats: 0.0877641961
    floats: 0.407431662
    floats: 0.592251956
    floats: 0.0183202717
    floats: 0.518030822
    floats: 0.40923351
    floats: 0.254391432
    floats: 0.0957848653
    floats: 0.579632521
    floats: 0.64569062
    floats: 0.278340042
    floats: 0.374406099
    floats: 0.0296448842
    floats: 0.208703905
    floats: 0.19381699
    floats: 1.09682345
    floats: 0.549204
    floats: 0.378695518
    floats: 0.534192145
    floats: 0.637916565
    floats: 0.481897116
    floats: 0.258450717
    floats: 0.685256958
    floats: -0.342289686
    floats: 0.0283202976
    floats: 0.767842352
    floats: 4.32172585
    floats: 0.106579036
    floats: -0.0238928683
    floats: 0.304074943
    floats: 0.340430617
    floats: 0.524377823
    floats: -0.313271642
    floats: 0.70988512
    floats: 0.0900205746
    floats: 0.205218777
    floats: -0.0416708402
    floats: 0.231770784
    floats: 0.80768913
    floats: 0.453570157
    floats: 0.478772879
    floats: 0.549461901
    floats: 0.695059478
    floats: 0.293788284
    floats: 0.458954215
    floats: 0.196185738
    floats: 0.461654186
    floats: 0.333613247
    floats: -0.0185648389
    floats: 0.381819189
    floats: 0.588550568
    floats: 0.0752069876
    floats: 0.316184
    floats: -0.0885150209
    floats: 0.207535222
    floats: 0.414518386
    floats: 0.304504901
    floats: 0.55782491
    floats: 0.0772678107
    floats: 0.28434521
    floats: 0.0744534358
    floats: 0.295619696
    floats: 0.245343849
    floats: 0.414375365
    floats: 0.952139556
    floats: 0.258791804
    floats: -0.0234737266
    floats: 0.744063675
    floats: 0.520727038
    floats: 0.192381799
    floats: 0.280089378
    floats: 0.217866436
    floats: 0.355810225
    floats: 0.0487213656
    floats: 0.0213812646
    floats: -0.00742734736
    floats: -0.0170811769
    floats: 0.240933895
    floats: 0.0197383687
    floats: 0.0301683974
    floats: 0.358838499
    floats: 0.274411142
    floats: 0.330976903
    floats: 0.492906064
    floats: 0.701497853
    floats: 0.855367482
    floats: -0.46737045
    floats: 0.304259032
    floats: 0.327839226
    floats: 0.734755814
    floats: 0.100450538
    floats: 0.0967242494
    floats: 0.619574904
    floats: 0.188491315
    floats: 0.316706806
    floats: 0.0928567052
    floats: 0.0108349528
    floats: 0.706350625
    floats: 0.306409717
    floats: -0.00776512409
    floats: 0.500417888
    floats: 0.348922253
    floats: 0.0177705362
    floats: 0.434082657
    floats: 0.238685608
    floats: 0.252339482
    floats: -0.407358348
    floats: 0.200548708
    floats: 0.595905364
  }
}
op {
  output: "xception2_match_conv_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 128
    ints: 1
    ints: 1
  }
}
op {
  output: "xception2_match_conv_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_match_conv_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_match_conv_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_match_conv_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_match_conv_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "xception2_match_conv_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 0.646134436
    floats: 0.479376584
    floats: -0.300026715
    floats: 0.325734973
    floats: 0.44125
    floats: 0.612395048
    floats: 0.806340218
    floats: 0.268603176
    floats: 0.240289867
    floats: -0.556341
    floats: 0.303553343
    floats: -0.433620095
    floats: 0.40664193
    floats: 0.357372463
    floats: 0.335163206
    floats: -0.371326894
    floats: 0.597651541
    floats: 0.365138859
    floats: 0.629196584
    floats: -0.252841175
    floats: -0.274967819
    floats: -0.324504554
    floats: -0.0475573316
    floats: 0.325385213
    floats: 0.201416686
    floats: 0.256464869
    floats: 0.50636214
    floats: 0.172356427
    floats: 0.161746338
    floats: -0.43380186
    floats: 0.59184891
    floats: 0.0529118516
    floats: 0.226042256
    floats: -0.172413707
    floats: 0.516872346
    floats: -0.152974501
    floats: 0.200489208
    floats: 0.531079412
    floats: 0.436341584
    floats: 0.721170425
    floats: -0.242450088
    floats: 0.417928576
    floats: -0.0610393845
    floats: -0.0450708792
    floats: 0.209941417
    floats: 0.478836268
    floats: 0.483006179
    floats: -0.0413888544
    floats: 0.531921506
    floats: -0.270538837
    floats: 0.425630093
    floats: -0.550933182
    floats: -0.472848266
    floats: 0.499326229
    floats: 0.907088101
    floats: 0.24494949
    floats: 0.662352
    floats: 1.01942849
    floats: -0.322976589
    floats: 0.603182852
    floats: 0.55521971
    floats: 0.368470222
    floats: 0.701489
    floats: 0.0538316667
    floats: 0.0483300798
    floats: -0.331552029
    floats: 0.119747065
    floats: -0.312724769
    floats: -0.0359180607
    floats: 0.349089324
    floats: -0.192148983
    floats: 0.603231728
    floats: -0.229294971
    floats: -0.0575810932
    floats: -0.162617877
    floats: 0.270449311
    floats: 0.183783129
    floats: 0.215222105
    floats: 0.167426214
    floats: 0.835241079
    floats: 0.504579425
    floats: 0.437882572
    floats: 0.0382826515
    floats: 0.258361846
    floats: -0.0623571128
    floats: 0.670255899
    floats: 0.159774333
    floats: 0.414875656
    floats: -0.0109928949
    floats: 0.088492915
    floats: 0.188814282
    floats: 0.0668224394
    floats: -0.111437447
    floats: -0.445208579
    floats: 0.0654309392
    floats: 0.684858918
    floats: 0.652618349
    floats: -0.230362892
    floats: 0.492459625
    floats: 0.373708516
    floats: 0.528053641
    floats: -0.301214665
    floats: 0.14826104
    floats: 0.199353084
    floats: -0.326803654
    floats: 0.58191067
    floats: 0.40878877
    floats: -0.0898589715
    floats: 0.366030604
    floats: 0.0688528121
    floats: 0.179152563
    floats: -1.28434277
    floats: -0.100210555
    floats: -0.0276864972
    floats: -0.174718425
    floats: 0.457440138
    floats: 0.432502151
    floats: 0.677118659
    floats: 0.31835869
    floats: 0.0731716454
    floats: 0.531644702
    floats: -0.564140081
    floats: 1.03490853
    floats: -0.190549508
    floats: 0.124398634
    floats: 0.133091062
    floats: 0.216443032
    floats: 0.421551943
    floats: -0.316258639
    floats: 0.463870853
    floats: 0.916305959
    floats: 0.367297471
    floats: 0.722330511
    floats: 0.524791658
    floats: -0.281879663
    floats: -0.088675335
    floats: -0.367913783
    floats: -0.0806319
    floats: 0.0562901311
    floats: -0.300222099
    floats: 0.270265073
    floats: -0.130255714
    floats: -0.615758717
    floats: 0.146158949
    floats: -0.079924
    floats: 0.11734958
    floats: 0.510054946
    floats: 0.576607227
    floats: 0.56276226
    floats: 0.0004458935
    floats: -0.0860619321
    floats: 0.249634072
    floats: 0.253011495
    floats: 0.271274716
    floats: 0.0721827075
    floats: -0.101716444
    floats: 0.0140816225
    floats: 0.639425874
    floats: 0.32800284
    floats: 0.630910277
    floats: 0.0280207228
    floats: -1.14959574
    floats: 0.562319
    floats: -0.266499251
    floats: 0.767242312
    floats: -0.317415118
    floats: -0.0274863485
    floats: -0.561295748
    floats: -0.163596198
    floats: 0.828617811
    floats: 0.410009682
    floats: -0.164372474
    floats: 0.496492565
    floats: 0.333505541
    floats: 0.575415909
    floats: 0.305319756
    floats: 0.0487016961
    floats: 0.766101301
    floats: -0.122829631
    floats: -0.199191421
    floats: 0.464890242
    floats: 0.5533759
    floats: 0.144059464
    floats: 0.540419757
    floats: 0.129400194
    floats: 0.449012667
    floats: -0.0790376514
    floats: 0.359471887
    floats: 0.00229981309
    floats: 0.504080951
    floats: -0.0376310125
    floats: 0.464070022
    floats: -0.16698271
    floats: -0.0756694451
    floats: 0.100888662
    floats: 0.105005659
    floats: 0.120984904
    floats: 0.512059093
    floats: 0.452913225
    floats: 0.0396926664
    floats: 0.415909648
    floats: -0.531104863
    floats: -0.30005154
    floats: 0.703849196
    floats: 0.691704452
    floats: 0.369341582
    floats: -0.112172343
    floats: 0.117415294
    floats: -0.0201034024
    floats: 0.468579322
    floats: 0.317533135
    floats: -0.0618578456
    floats: 0.158172667
    floats: -0.509084404
    floats: -0.564161599
    floats: 0.486531049
    floats: 0.56977725
    floats: 0.353833914
    floats: 0.197898984
    floats: 0.535926163
    floats: 0.54809922
    floats: -0.00704443315
    floats: -0.106016152
    floats: -0.142434716
    floats: 0.281414896
    floats: 0.0716714486
    floats: 0.57311815
    floats: -0.259309947
    floats: 0.391602099
    floats: 0.75869745
    floats: -0.121739767
    floats: 0.04626102
    floats: -0.00597016653
    floats: -0.188530758
    floats: 0.202020511
    floats: 0.314358652
    floats: 0.121947259
    floats: 0.536907375
    floats: 0.272603869
    floats: 0.419031948
    floats: -0.104331486
    floats: -0.0183314756
    floats: 0.137070537
    floats: -0.29056105
    floats: -0.23589626
    floats: 0.0981585607
    floats: -0.447772324
    floats: 0.505703568
    floats: 0.308633029
    floats: 0.562065661
    floats: -0.275167
    floats: 0.779672086
    floats: 0.395360887
    floats: 0.817804694
    floats: -0.0604015626
    floats: 0.0497296602
  }
}
op {
  output: "xception2_conv1_1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 128
    ints: 1
    ints: 3
    ints: 3
  }
}
op {
  output: "xception2_conv1_2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 128
    ints: 1
    ints: 1
  }
}
op {
  output: "xception2_conv1_2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv1_2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv1_2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv1_2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv1_2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
  }
}
op {
  output: "xception2_conv1_2_b"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: -0.366024643
    floats: -0.121016793
    floats: 0.0213064626
    floats: -0.0801781639
    floats: 1.3480593
    floats: 1.74442577
    floats: 2.23148918
    floats: -0.441253334
    floats: 0.132074669
    floats: 1.31900287
    floats: -0.466066957
    floats: 0.552558839
    floats: -0.280715495
    floats: -0.154401064
    floats: 2.31410885
    floats: 0.911126375
    floats: -0.382814556
    floats: -0.530237198
    floats: 0.993018925
    floats: -0.679155052
    floats: 1.03499937
    floats: 0.121799536
    floats: 0.236334324
    floats: 0.0909947082
    floats: -0.970288932
    floats: 0.21143806
    floats: -0.112117946
    floats: 0.261401355
    floats: -0.396145105
    floats: 0.0881118774
    floats: 1.5509187
    floats: 0.648432255
    floats: -0.509729743
    floats: 0.260992914
    floats: -0.0206901189
    floats: -0.516050756
    floats: -0.186754242
    floats: -0.251045316
    floats: 0.446697026
    floats: -0.382001579
    floats: 0.0980696827
    floats: -0.0865644217
    floats: 1.12975526
    floats: 2.01960659
    floats: -0.125865057
    floats: -0.904922962
    floats: 0.190165669
    floats: 0.357015133
    floats: 0.219486415
    floats: 0.899873734
    floats: -0.147839591
    floats: 0.178041533
    floats: -0.0268317591
    floats: -0.285257846
    floats: 0.233195379
    floats: 0.0481070355
    floats: 0.375018686
    floats: 0.654379487
    floats: 0.24866721
    floats: -0.0201202538
    floats: -0.0474169515
    floats: 0.170681044
    floats: -0.27976802
    floats: -0.044776246
    floats: 0.120861217
    floats: 0.529912829
    floats: 0.287611783
    floats: -0.658178806
    floats: 0.466254056
    floats: -0.0751901567
    floats: -0.100762323
    floats: 0.183620721
    floats: 0.45088008
    floats: -0.0446055792
    floats: -0.182071343
    floats: 0.180279583
    floats: 0.159735888
    floats: -0.226761505
    floats: -0.332463324
    floats: 0.154724285
    floats: -0.277995884
    floats: -0.38828069
    floats: 0.194417283
    floats: -0.388208628
    floats: -0.351100743
    floats: 0.92867738
    floats: 0.0500107445
    floats: 0.0970312431
    floats: 1.35278749
    floats: 0.924338043
    floats: -0.124721743
    floats: -0.345251292
    floats: -0.141027957
    floats: 0.897715449
    floats: 0.327330828
    floats: 1.89734685
    floats: -0.203846529
    floats: -0.232679948
    floats: -0.356642276
    floats: -0.304671347
    floats: 0.155807897
    floats: 0.772271037
    floats: -0.202898875
    floats: 0.197439983
    floats: -0.201461837
    floats: 0.0348644406
    floats: 0.817157328
    floats: 1.10226464
    floats: -0.559086
    floats: -0.202283189
    floats: 0.772336662
    floats: 1.37976098
    floats: -0.21257484
    floats: 0.401188284
    floats: 0.296927065
    floats: -0.234400854
    floats: -0.356082886
    floats: 2.045017
    floats: 0.0946520567
    floats: 0.431885511
    floats: 0.91064471
    floats: 0.587076306
    floats: 1.66320419
    floats: 1.37832594
    floats: -0.187263429
    floats: -0.138577357
    floats: -0.137080312
    floats: -0.400511086
    floats: 0.0400272645
    floats: -0.281835467
    floats: 0.420897365
    floats: 0.0602227338
    floats: -0.34283936
    floats: 0.0874952823
    floats: 1.06460714
    floats: 0.0974336416
    floats: -0.433943182
    floats: -0.565979242
    floats: 1.12954617
    floats: 0.607361853
    floats: 1.0924679
    floats: -1.01372039
    floats: -0.0171688162
    floats: 1.02157104
    floats: -0.695708215
    floats: 1.63684547
    floats: 1.22031009
    floats: -0.405511707
    floats: 0.807582796
    floats: -0.128701314
    floats: -0.224804923
    floats: 0.777225375
    floats: -0.660684824
    floats: -0.260406613
    floats: 0.0908160508
    floats: 0.157645479
    floats: -0.00510423863
    floats: 1.44398892
    floats: 1.53043222
    floats: -0.164579928
    floats: 0.0328479707
    floats: 0.926381469
    floats: -0.418476641
    floats: 0.086733304
    floats: 0.288353056
    floats: 0.328791738
    floats: 1.09134889
    floats: 0.393445045
    floats: 0.959585786
    floats: 1.26326561
    floats: -0.292550594
    floats: 0.314065933
    floats: -0.292580783
    floats: 0.111919969
    floats: 1.75803232
    floats: 0.299580961
    floats: -0.230037227
    floats: 2.06624031
    floats: 0.392392159
    floats: 0.484793067
    floats: 0.0618040822
    floats: 0.71161896
    floats: -0.367732763
    floats: 0.00702577597
    floats: 1.59547615
    floats: 0.227949604
    floats: 0.202954844
    floats: -0.492633879
    floats: 0.683605075
    floats: -0.422324091
    floats: -0.0680511743
    floats: 0.535664439
    floats: -0.38769412
    floats: -0.435563624
    floats: -0.179310665
    floats: 0.988390505
    floats: 0.594860435
    floats: 0.249738604
    floats: -0.284753233
    floats: -0.554021657
    floats: -0.560857713
    floats: 0.0511526912
    floats: -0.808428586
    floats: -0.0211547967
    floats: -1.08750975
    floats: -0.288329929
    floats: 0.162662208
    floats: 1.30265164
    floats: 0.19192028
    floats: 0.136777177
    floats: 0.632400095
    floats: -0.0925840959
    floats: -0.622993708
    floats: 1.17429256
    floats: 1.02147865
    floats: -0.285065889
    floats: -0.455684781
    floats: -0.0693093836
    floats: 0.362225294
    floats: 1.51703358
    floats: -0.2322319
    floats: 1.63768244
    floats: -0.497758567
    floats: -0.0177945439
    floats: 0.0065117362
    floats: 0.510730863
    floats: 0.52065295
    floats: 0.197254
    floats: 0.312868863
    floats: -0.426910132
    floats: 1.04950929
    floats: -0.354473591
    floats: -0.135245249
    floats: 1.70754659
    floats: 0.72250551
    floats: 1.08100343
    floats: -0.272376746
    floats: -0.463131934
    floats: 0.768513203
    floats: 0.0507501028
    floats: -0.951001942
    floats: 0.093436271
    floats: -0.0196918342
    floats: 0.0575586483
    floats: 0.248512834
    floats: 0.570473254
    floats: 1.20940638
    floats: 0.105877854
    floats: -0.0360331833
    floats: -0.151090324
    floats: -0.363263279
    floats: 0.170354903
    floats: 0.309818625
    floats: -0.0149833392
    floats: 0.256998
    floats: -0.0219511986
  }
}
op {
  output: "xception2_conv2_1_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 1
    ints: 3
    ints: 3
  }
}
op {
  output: "xception2_conv2_2_w"
  type: "XavierFill"
  arg {
    name: "shape"
    ints: 256
    ints: 256
    ints: 1
    ints: 1
  }
}
op {
  output: "xception2_conv2_2_scale"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv2_2_bias"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv2_2_mean"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 0
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv2_2_var"
  type: "ConstantFill"
  arg {
    name: "value"
    f: 1
  }
  arg {
    name: "shape"
    ints: 256
  }
}
op {
  output: "xception2_conv2_2_w_second"
  name: ""
  type: "GivenTensorFill"
  arg {
    name: "shape"
    ints: 256
  }
  arg {
    name: "values"
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
    floats: 1
